# CMSC 461 Fall 2020: Project 1: User Manual 
## By: Bryan Delas Penas

## Connect SQLlite to Juypiter Notebook

In [1]:
# Refer to SQL_Magic_demo shared in the Google Colab by Dr. Kalpakis
#
# setup and load the sql magic extension

!pip install ipython-sql
%load_ext sql

# for SQLite databases 

# for SQLite databases
# Set the pathname for the local file that stores the SQLite database
db_filename = 'projectdb.sqlite'
connection_url = f'sqlite:///{db_filename}'

# for MySQL databases 
# define appropriate MySQL connection string 
#
# Suppose that you have installed the mysql-connector-python package
!pip install mysql-connector-python
#
# for user 'scott' with password 'tiger' connecting to database 'foo' 
# running on database server at IP address 'localhost', 
# the connection URL string will look like 
connection_url = 'mysql+pymysql://bryan:bdelasp1@localhost:3306/projectdb'
connection_url = 'mysql+mysqlconnector://bryan:bdelasp1@localhost:3306/projectdb'

# Open a connection to the database
%sql sqlite:///test.sqlite
%sql {connection_url}

Requirement already satisfied: ipython-sql in c:\users\bryan\anaconda3\lib\site-packages (0.4.0)
Requirement already satisfied: prettytable<1 in c:\users\bryan\anaconda3\lib\site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: sqlparse in c:\users\bryan\anaconda3\lib\site-packages (from ipython-sql) (0.3.1)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\users\bryan\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: six in c:\users\bryan\anaconda3\lib\site-packages (from ipython-sql) (1.12.0)
Requirement already satisfied: ipython>=1.0 in c:\users\bryan\anaconda3\lib\site-packages (from ipython-sql) (7.8.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\users\bryan\anaconda3\lib\site-packages (from ipython-sql) (1.3.9)
Requirement already satisfied: prompt-toolkit<2.1.0,>=2.0.0 in c:\users\bryan\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (2.0.10)
Requirement already satisfied: decorator in c:\users\bryan\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (4.4.0)
Requirement already satisfied: pygments in c:\users\bryan\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (2.4.2)
Requirement already satisfied: colorama; sys_platform == "win32" in c:\users\bryan\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.1)
Requirement already satisfied: backcall in c:\users\bryan\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.1.0)
Requirement already satisfied: traitlets>=4.2 in c:\users\bryan\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (4.3.3)
Requirement already satisfied: jedi>=0.10 in c:\users\bryan\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.15.1)
Requirement already satisfied: setuptools>=18.5 in c:\users\bryan\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (41.4.0)
Requirement already satisfied: pickleshare in c:\users\bryan\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: wcwidth in c:\users\bryan\anaconda3\lib\site-packages (from prompt-toolkit<2.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.1.7)
Requirement already satisfied: parso>=0.5.0 in c:\users\bryan\anaconda3\lib\site-packages (from jedi>=0.10->ipython>=1.0->ipython-sql) (0.5.1)
Requirement already satisfied: mysql-connector-python in c:\users\bryan\anaconda3\lib\site-packages (8.0.21)
Requirement already satisfied: protobuf>=3.0.0 in c:\users\bryan\anaconda3\lib\site-packages (from mysql-connector-python) (3.11.4)
Requirement already satisfied: six>=1.9 in c:\users\bryan\anaconda3\lib\site-packages (from protobuf>=3.0.0->mysql-connector-python) (1.12.0)
Requirement already satisfied: setuptools in c:\users\bryan\anaconda3\lib\site-packages (from protobuf>=3.0.0->mysql-connector-python) (41.4.0)

## The data required inside of the Database
Populate your database with at least <br>
1) 6 employees <br>
2) 12 clients <br>
3) 6 private owners <br>
4) 6 rental properties of each type (residential, commercial, industrial) <br>
5) 12 property viewings <br>
6) 6 leases <br>
and appropriate relationship instances among them. <br>

## Relational Schema for the Database
![](attachment:image.png)
<center><img src="Project_DB_RelationalSchema.png" align="center"/></center>

## Entity/Relationship Keys

### Entities 
<b>Entity: Employee </b> <br> 
Primary Key: Employee_Num, Supervisor_Num<br>
Foreign Key: None<br>

<b>Entity: Associates</b> <br>
Primary Key: Employee_Num<br>
Foreign Key: Employee_Num REFERENCES Employee<br>

<b>Entity: Partners</b> <br> 
Primary Key: Employee_Num<br>
Foreign Key: Employee_Num REFERENCES Employee<br>

<b>Entity: Lease</b> <br> 
Primary Key: Lease_Num<br>
Foreign Key: None<br>

<b>Entity: Property_Owner</b> <br> 
Primary Key: Owner_Num, Employee_Num<br>
Foreign Key: Employee_num REFERENCES Partners<br>

<b>Entity: Client</b> <br> 
Primary Key: Client_Num<br>
Foreign Key: None<br>

<b>Entity: Rental_Properties</b> <br> 
Primary Key: Property_Num<br>
Foreign Key: None<br>

<b>Entity: Residential</b> <br> 
Primary Key: Property_Num<br>
Foreign Key: Property_Num REFERENCES Rental_Properties<br>

<b>Entity: Commerical</b> <br> 
Primary Key: Property_Num<br>
Foreign Key: Property_Num REFERENCES Rental_Properties<br>

<b>Entity: Industrial</b> <br> 
Primary Key: Property_Num<br>
Foreign Key: Property_Num REFERENCES Rental_Properties<br>

<b>Entity: Property_Viewing</b> <br> 
Primary Key: None<br>
Foreign Key: Property_Num REFERENCES Rental_Properties<br>

### Relationships
<b>Relationship: Arranges</b> <br> 
Primary Key: None<br>
Foreign Key: Employee_Num REFERENCES Employee<br>
             Property_Num REFERENCES Rental_Properties<br>
             
<b>Relationship: Assigned_Partner</b> <br> 
Primary Key: Owner_Num<br>
Foreign Key: Employee_Num references Employee<br>
             Owner_Num REFERENCES Property_Owner<br>

<b>Relationship: Assigned_Property</b> <br> 
Primary Key: Property_Num<br>
Foreign Key: Employee_Num REFERENCES Employee<br>
             Owner_Num REFERENCES Property_Owner<br>

<b>Relationship: Contract</b> <br> 
Primary Key: Lease_Num, Property_Num<br>
Foreign Key: Lease_Num REFERENCES Lease<br>
             Property_Num REFERENCES Rental_Properties
             
<b>Relationship: Owned_By</b> <br> 
Primary Key: Property_Num<br>
Foreign Key: Property_Num REFERENCES Rental_Properties<br>
             Owner_Num REFERENCES Property_Owner<br>
             
<b>Relationship: Tours</b> <br> 
Primary Key: None<br>
Foreign Key: Owner_Num REFERENCES Property_Owner<br>

<b>Relationship: Views</b> <br> 
Primary Key: None<br>
Foreign Key: Client_Num REFERENCES Client<br><br>

<b>Relationship: Sign_Lease</b> <br>
Primary Key: Client_Num, Lease_Num<br>
Foreign Key: Client_Num REFERENCES Client<br>
             Lease_Num REFERENCES Lease<br>
             
<b>Relationship: Writes_Lease</b> <br>
Primary Key: Employee_Num, Lease_Num<br>
Foreign Key: Employee_Num REFERENCES Employee<br>
             Lease_Num REFERENCES Lease<br>

## Data Types 
Integers: Any number <br>
Varchar:  Any amount of characters <br>  
Date:     Year - Month - Day <br>
Boolean:  1 equals True, 0 equals False <br>

## Create Table Script

In [3]:
%%sql 
USE ProjectDB;
CREATE TABLE Employee( 
Employee_Num        INT NOT NULL UNIQUE,  
Supervisor_Num      INT NOT NULL, 
Employee_Name       VARCHAR(45) NOT NULL UNIQUE,
Employee_Email      VARCHAR(45) UNIQUE, 
Employee_Street     VARCHAR(45) NOT NULL,
Employee_City       VARCHAR(45) NOT NULL, 
Employee_State      VARCHAR(45) NOT NULL,
Employee_Zip_Code   INT NOT NULL, 
Employee_Unit_Num   INT, 
Employee_Home_Phone   VARCHAR(11),
Employee_Work_Phone   VARCHAR(11), 
Employee_Mobile_Phone VARCHAR(11), 
PRIMARY KEY (Employee_Num, Supervisor_Num) ,
CHECK(Employee_Home_Phone NOT LIKE '%[^0-9]%'), 
CHECK(Employee_Work_Phone NOT LIKE '%[^0-9]%'), 
CHECK(Employee_Mobile_Phone NOT LIKE '%[^0-9]%') 
);
CREATE TABLE Associates( 
Employee_Num     INT NOT NULL UNIQUE,
Employee_Name    VARCHAR(45) NOT NULL UNIQUE,
Property_Amount  INT NOT NULL,
CHECK(Property_Amount <= 12),
FOREIGN KEY(Employee_Num) REFERENCES Employee(Employee_Num)
);
CREATE TABLE Partners( 
Employee_Num       INT NOT NULL UNIQUE,
Employee_Name      VARCHAR(45) NOT NULL UNIQUE,
Property_Owner_Num INT NOT NULL,
CHECK(Property_Owner_Num <= 1),
PRIMARY KEY(Employee_Num),
FOREIGN KEY(Employee_Num) REFERENCES Employee(Employee_Num)
); 
CREATE TABLE Lease(
Lease_Num          INT NOT NULL UNIQUE,
Lease_Date         DATE  NULL, 
Lease_Deposit      INT, 
Lease_Monthly_Rent INT NOT NULL,
Lease_Start_Date   DATE NOT NULL, 
Lease_End_Date     DATE NOT NULL, 
PRIMARY KEY(Lease_NUM),
CHECK(DATEDIFF(Lease_End_Date, Lease_Start_Date) > 0),
CHECK(Lease_Monthly_Rent > 0), 
CHECK(DATEDIFF(Lease_End_Date, Lease_Start_Date ) >= 91), 
CHECK(DATEDIFF(Lease_End_Date, Lease_Start_Date) <= 1095)
);
CREATE TABLE Property_Owner(
Owner_Num          INT NOT NULL UNIQUE,
Employee_Num       INT NOT NULL,
Owner_Name         VARCHAR(45) NOT NULL UNIQUE,
Owner_Email        VARCHAR(45), 
Owner_Street       VARCHAR(45) NOT NULL,
Owner_City         VARCHAR(45) NOT NULL,
Owner_State        VARCHAR(45) NOT NULL,
Owner_Zip_Code     INT NOT NULL,
Owner_Unit_Num     INT, 
Owner_Home_Phone   INT,
Owner_Work_Phone   INT,
Owner_Mobile_Phone INT,  
PRIMARY KEY(Owner_Num, Employee_Num),
FOREIGN KEY(Employee_Num) REFERENCES Partners(Employee_Num),
CHECK(Owner_Home_Phone NOT LIKE '%[^0-9]%'), 
CHECK(Owner_Work_Phone NOT LIKE '%[^0-9]%'), 
CHECK(Owner_Mobile_Phone NOT LIKE '%[^0-9]%') 
);
CREATE TABLE Client(
Client_Num          Int NOT NULL UNIQUE, 
Client_Name         VARCHAR(45) NOT NULL UNIQUE, 
Client_Email        VARCHAR(45), 
Maxium_Willing_Rent INT NOT NULL, 
Property_Pref       VARCHAR(45) NOT NULL,
Client_Street       VARCHAR(45) NOT NULL,
CLient_City         VARCHAR(45) NOT NULL, 
Client_State        VARCHAR(45) NOT NULL,
CLient_Zip_Code     INT NOT NULL,
Client_Unit_Num     INT, 
Client_Home_Phone   INT,
Client_Work_Phone   INT,
Client_Mobile_Phone INT, 
PRIMARY KEY(Client_Num),
CHECK(Property_Pref IN ('Residential', 'Commerical', 'Industrial')),
CHECK(Maxium_Willing_Rent > 0), 
CHECK(Client_Home_Phone NOT LIKE '%[^0-9]%'), 
CHECK(Client_Work_Phone NOT LIKE '%[^0-9]%'), 
CHECK(Client_Mobile_Phone NOT LIKE '%[^0-9]%') 
);
CREATE TABLE Rental_Properties(
Property_Num        INT NOT NULL UNIQUE, 
Property_Name       VARCHAR(45) NOT NULL UNIQUE, 
Area_Square_Footing INT NOT NULL, 
Monthly_Manage_Fee  INT NOT NULL, 
Advertised          BOOLEAN, 
Property_Type       VARCHAR(45) NOT NULL, 
Property_Street     VARCHAR(45) NOT NULL,
Property_City       VARCHAR(45) NOT NULL, 
Property_State      VARCHAR(45) NOT NULL,
Property_Zip_Code   INT NOT NULL,
Property_Unit_Num   INT, 
PRIMARY KEY(Property_Num)
);
CREATE TABLE Residential(
Property_Num INT NOT NULL UNIQUE, 
Property_Name VARCHAR(45),
Bathroom_Num INT NOT NULL, 
Bedroom_Num  INT NOT NULL,
PRIMARY KEY(Property_Num),
FOREIGN KEY(Property_Num) REFERENCES Rental_Properties(Property_Num), 
Check(Bathroom_Num > 0),
Check(Bedroom_Num > 0)
);
CREATE TABLE Commerical(
Property_Num    INT NOT NULL UNIQUE,
Property_Name VARCHAR(45),
Coperation_Name VARCHAR(45) NOT NULL,
PRIMARY KEY(Property_NUM),
FOREIGN KEY(Property_Num) REFERENCES Rental_Properties(Property_Num)
);
CREATE TABLE Industrial(
Property_Num    INT NOT NULL UNIQUE,
Property_Name VARCHAR(45),
Industrial_Name VARCHAR(45) NOT NULL,
PRIMARY KEY(Property_Num),
FOREIGN KEY(Property_Num) REFERENCES Rental_Properties(Property_Num)
);
CREATE TABLE Property_Viewing(
Property_Num       INT NOT NULL, 
Property_Name      VARCHAR(45)  NOT NULL,
Viewing_Date       DATE NOT NULL,
-- Viewing_Date_Check BOOL NOT NULL,
Viewing_Time       TIME  NOT NULL,
FOREIGN KEY(Property_Num) REFERENCES Rental_Properties(Property_Num),
UNIQUE(Viewing_Date, Viewing_Time)
);
CREATE TABLE Arranges(
Employee_Num  INT NOT NULL,
Employee_Name VARCHAR(45) NOT NULL,
Property_Num  INT NOT NULL,
Property_Name VARCHAR(45) NOT NULL,
Viewing_Date       DATE NOT NULL,
Viewing_Time       TIME  NOT NULL,
FOREIGN KEY(Employee_Num) REFERENCES Employee(Employee_Num),
FOREIGN KEY(Property_Num) REFERENCES Rental_Properties(Property_Num)
);
CREATE TABLE Assigned_Partner(
Employee_Num       INT NOT NULL,
Employee_Name      VARCHAR(45) NOT NULL,
Owner_Num          INT NOT NULL UNIQUE,
Owner_Name         VARCHAR(45) NOT NULL, 
PRIMARY KEY(Owner_Num), 
FOREIGN KEY(Employee_Num) REFERENCES Employee(Employee_Num),
FOREIGN KEY(Owner_Num) REFERENCES Property_Owner(Owner_Num)

);
CREATE TABLE Assigned_Property(
Employee_Num    INT NOT NULL, 
Employee_Name   VARCHAR(45) NOT NULL,
Property_Num    INT NOT NULL UNIQUE, 
Property_Name   VARCHAR(45) NOT NULL, 
Property_Status BOOLEAN NOT NULL, 
PRIMARY KEY(Property_Num),
FOREIGN KEY(Employee_Num) REFERENCES Employee(Employee_Num), 
FOREIGN KEY(Property_Num) REFERENCES Rental_Properties(Property_Num)
);
CREATE TABLE Contract(
Lease_Num    INT NOT NULL UNIQUE,
Property_Name VARCHAR(45) NOT NULL, 
Property_Num INT NOT NULL UNIQUE,
PRIMARY KEY(Lease_Num, Property_Num),
FOREIGN KEY(Lease_Num) REFERENCES Lease(Lease_Num),
FOREIGN KEY(Property_Num) REFERENCES Rental_Properties(Property_Num)
);
CREATE TABLE Owned_By(
Property_Num INT NOT NULL UNIQUE,
Property_Name VARCHAR(45) NOT NULL,
Owner_Num    INT NOT NULL,
Owner_Name   VARCHAR(45) NOT NULL,
PRIMARY KEY(Property_Num),
FOREIGN KEY(Property_Num) REFERENCES Rental_Properties(Property_Num), 
FOREIGN KEY(Owner_Num) REFERENCES Property_Owner(Owner_Num)
);
CREATE TABLE Tours(
Owner_Num     INT NOT NULL,
Owner_Name    VARCHAR(45) NOT NULL,
Property_Num  INT NOT NULL,
Property_Name  VARCHAR(45) NOT NULL,
Tour_Date     DATE NOT NULL,
Tour_Time     TIME NOT NULL,
FOREIGN KEY(Owner_Num) REFERENCES Property_Owner(Owner_Num),
UNIQUE(Tour_Date, Tour_Time)
);
CREATE TABLE Views(
Client_Num         INT NOT NULL,
Client_Name        VARCHAR(45) NOT NULL,
Property_Num       INT NOT NULL,
Property_Name      VARCHAR(45) NOT NULL, 
View_Date          DATE NOT NULL,
View_Time          TIME NOT NULL,

FOREIGN KEY(Client_Num) REFERENCES Client(Client_Num),
FOREIGN KEY(Property_Num) REFERENCES Rental_Properties(Property_Num),
UNIQUE(Client_num, View_Date),
UNIQUE(View_Date, View_Time)
);

CREATE TABLE Sign_Lease(
Client_Num INT NOT NULL,
Client_Name VARCHAR(45) NOT NULL,
Lease_Num  INT NOT NULL,
PRIMARY KEY(Client_Num, Lease_Num),
FOREIGN KEY(Lease_Num) REFERENCES Lease(Lease_Num),
FOREIGN KEY(Client_Num) REFERENCES Client(Client_Num),
Unique(Client_Num, Client_Name, Lease_Num)
);
CREATE TABLE Writes_Lease(
Employee_Num INT NOT NULL, 
Employee_Name VARCHAR(45) NOT NULL, 
Lease_Num    INT NOT NULL UNIQUE,
PRIMARY KEY(Employee_Num, Lease_Num), 
FOREIGN KEY(Employee_Num) REFERENCES Employee(Employee_Num), 
FOREIGN KEY(Lease_Num) REFERENCES Lease(Lease_Num)
);

 * mysql+mysqlconnector://bryan:***@localhost:3306/projectdb
   sqlite:///test.sqlite
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

## Drop Table Script

In [2]:
%%sql 
USE ProjectDB;
DROP TABLE IF EXISTS Writes_Lease;
DROP TABLE IF EXISTS Sign_Lease;
DROP TABLE IF EXISTS Views;
DROP TABLE IF EXISTS Tours;
DROP TABLE IF EXISTS Owned_By;
DROP TABLE IF EXISTS Contract;
DROP TABLE IF EXISTS Assigned_Property;
DROP TABLE IF EXISTS Assigned_Partner;
DROP TABLE IF EXISTS Arranges;
DROP TABLE IF EXISTS Property_Viewing;
DROP TABLE IF EXISTS Industrial;
DROP TABLE IF EXISTS Commerical;
DROP TABLE IF EXISTS Residential;
DROP TABLE IF EXISTS Rental_Properties;
DROP TABLE IF EXISTS Client;
DROP TABLE IF EXISTS Property_Owner;
DROP TABLE IF EXISTS Lease;
DROP TABLE IF EXISTS Partners;
DROP TABLE IF EXISTS Associates;
DROP TABLE IF EXISTS Employee;

 * mysql+mysqlconnector://bryan:***@localhost:3306/projectdb
   sqlite:///test.sqlite
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

## Insertion Script (Test Data)

In [4]:
%%sql 
USE ProjectDB; 
-- The database must be all to be populated with the following requirements: 
-- •	6 employees  
-- •	12 clients  
-- •	6 private owners 
-- •	6 rental properties of each type (residential, commercial, industrial)  
-- •	12 property viewings 
-- •	6 leases and appropriate relationship instances among them.

-- 6 employees  
INSERT INTO Employee(Employee_Num, Supervisor_Num, Employee_Name, Employee_Email, Employee_Street, Employee_City, Employee_State, 
                     Employee_Zip_Code, Employee_Unit_Num, Employee_Home_Phone, Employee_Work_Phone, Employee_Mobile_Phone)
VALUES(1, 1, "John Bill", "jbill@umbc.edu", "45 Wise Avn", "Baltimore", "Maryland", "21223", 4,  "445", "4443", "5565");

INSERT INTO Employee(Employee_Num, Supervisor_Num, Employee_Name, Employee_Email, Employee_Street, Employee_City, Employee_State, 
                     Employee_Zip_Code, Employee_Unit_Num, Employee_Home_Phone, Employee_Work_Phone, Employee_Mobile_Phone)
VALUES(2, 1, "Bob Bell", "bbell@umbc.edu", "423 Merrit", "Baltimore", "Maryland", "21223", 5, "332", "4242", "42424"); 

INSERT INTO Employee(Employee_Num, Supervisor_Num, Employee_Name, Employee_Email, Employee_Street, Employee_City, Employee_State, 
                     Employee_Zip_Code, Employee_Unit_Num, Employee_Home_Phone, Employee_Work_Phone, Employee_Mobile_Phone)
VALUES(3, 1,  "Jimmy Red", "jred@umbc.edu", "231 Mid", "Baltimore", "Maryland", "21223", 1, NULL, NULL, NULL); 

INSERT INTO Employee(Employee_Num, Supervisor_Num, Employee_Name, Employee_Email, Employee_Street, Employee_City, Employee_State, 
                     Employee_Zip_Code, Employee_Unit_Num, Employee_Home_Phone, Employee_Work_Phone, Employee_Mobile_Phone)
VALUES(4,2,"Sam Green", "sgreen@umbc.edu", "1234 Top", "Baltimore", "Maryland", "21223", 6, NULL, NULL, NULL);

INSERT INTO Employee(Employee_Num, Supervisor_Num, Employee_Name, Employee_Email, Employee_Street, Employee_City, Employee_State, 
                     Employee_Zip_Code, Employee_Unit_Num, Employee_Home_Phone, Employee_Work_Phone, Employee_Mobile_Phone)
VALUES(5,3, "Quinn Blue", "qblue@umbc.edu", "543 GreenWay", "Baltimore", "Maryland", "21223", 9, NULL, NULL, NULL);

INSERT INTO Employee(Employee_Num, Supervisor_Num, Employee_Name, Employee_Email, Employee_Street, Employee_City, Employee_State, 
                     Employee_Zip_Code, Employee_Unit_Num, Employee_Home_Phone, Employee_Work_Phone, Employee_Mobile_Phone)
VALUES(6,4, "Tom Pink", "tpink@umbc.edu", "1345 RedWay", "Baltimore", "Maryland", "21223", NULL, NULL, NULL, NULL);

-- 3 Associates 
INSERT INTO Associates(Employee_Num, Employee_Name, Property_Amount)
VALUES(1, "John Bill", 10);

INSERT INTO Associates(Employee_Num, Employee_Name, Property_Amount)
VALUES(2, "Bob Bell", 4);

INSERT INTO Associates(Employee_Num, Employee_Name, Property_Amount)
VALUES(3, "Jimmy Red", 4);

-- 3 Partners 
INSERT INTO Partners(Employee_Num, Employee_Name, Property_Owner_Num)
Values(4, "Sam Green", 0);

INSERT INTO Partners(Employee_Num, Employee_Name, Property_Owner_Num)
Values(5, "Quinn Blue", 0);

INSERT INTO Partners(Employee_Num, Employee_Name, Property_Owner_Num)
Values(6, "Tom Pink", 0);
-- 12 clients
INSERT INTO Client(Client_Num, Client_Name, Client_Email, Maxium_Willing_Rent, Property_Pref, Client_Street, Client_City, 
                   Client_State, Client_Zip_Code, Client_Unit_Num, Client_Home_Phone, Client_Work_Phone, Client_Mobile_Phone) 
VALUES(1, "Stan Brown", "sbrown@umbc.edu", 10000, "Commerical", "563 A Street", "Baltimore", "Maryland", "21223", NULL, NULL, "3232", "232323");

INSERT INTO Client(Client_Num, Client_Name, Client_Email, Maxium_Willing_Rent, Property_Pref, Client_Street, Client_City, 
                   Client_State, Client_Zip_Code, Client_Unit_Num, Client_Home_Phone, Client_Work_Phone, Client_Mobile_Phone) 
VALUES(2, "James Pro", "jpro@umbc.edu", 100000, "Commerical", "56 B Street", "Baltimore", "Maryland", "21223", NULL, NULL, "322432", "23623");

INSERT INTO Client(Client_Num, Client_Name, Client_Email, Maxium_Willing_Rent, Property_Pref, Client_Street, Client_City, 
                   Client_State, Client_Zip_Code, Client_Unit_Num, Client_Home_Phone, Client_Work_Phone, Client_Mobile_Phone) 
VALUES(3, "Lance Bo", "lbo@umbc.edu", 12000, "Commerical", "63 C Street", "Baltimore", "Maryland", "21223", NULL, NULL, "3232", "232323");

INSERT INTO Client(Client_Num, Client_Name, Client_Email, Maxium_Willing_Rent, Property_Pref, Client_Street, Client_City, 
                   Client_State, Client_Zip_Code, Client_Unit_Num, Client_Home_Phone, Client_Work_Phone, Client_Mobile_Phone) 
VALUES(4, "Nanes Po", "npo@umbc.edu", 40000, "Commerical", "578 D Street", "Baltimore", "Maryland", "21223", NULL, NULL, "320032", "234212323");

INSERT INTO Client(Client_Num, Client_Name, Client_Email, Maxium_Willing_Rent, Property_Pref, Client_Street, Client_City, 
                   Client_State, Client_Zip_Code, Client_Unit_Num, Client_Home_Phone, Client_Work_Phone, Client_Mobile_Phone) 
VALUES(5, "Krames Taq", "ktaq@umbc.edu", 990, "Residential", "123 E Street", "Baltimore", "Maryland", "21223", NULL, NULL, "329932", "25632323");

INSERT INTO Client(Client_Num, Client_Name, Client_Email, Maxium_Willing_Rent, Property_Pref, Client_Street, Client_City, 
                   Client_State, Client_Zip_Code, Client_Unit_Num, Client_Home_Phone, Client_Work_Phone, Client_Mobile_Phone) 
VALUES(6, "Ame Un", "aun@umbc.edu", 1000, "Residential", "104 F Street", "Baltimore", "Maryland", "211223", NULL, NULL, "323652", "232323");

INSERT INTO Client(Client_Num, Client_Name, Client_Email, Maxium_Willing_Rent, Property_Pref, Client_Street, Client_City, 
                   Client_State, Client_Zip_Code, Client_Unit_Num, Client_Home_Phone, Client_Work_Phone, Client_Mobile_Phone) 
VALUES(7, "Suzanne Joseph", "sjoseph@umbc.edu", 109700, "Residential", "101 G Street", "Baltimore", "Maryland", "211223", NULL, NULL, "362", "555");

INSERT INTO Client(Client_Num, Client_Name, Client_Email, Maxium_Willing_Rent, Property_Pref, Client_Street, Client_City, 
                   Client_State, Client_Zip_Code, Client_Unit_Num, Client_Home_Phone, Client_Work_Phone, Client_Mobile_Phone) 
VALUES(8, "Valentino Castro", "vcastro@umbc.edu", 523000, "Residential", "190 H Street", "Baltimore", "Maryland", "211223", NULL, NULL, "309", "194");

INSERT INTO Client(Client_Num, Client_Name, Client_Email, Maxium_Willing_Rent, Property_Pref, Client_Street, Client_City, 
                   Client_State, Client_Zip_Code, Client_Unit_Num, Client_Home_Phone, Client_Work_Phone, Client_Mobile_Phone) 
VALUES(9, "Bethany Devlin", "bdevlin@umbc.edu", 344500, "Industrial", "063 I Street", "Baltimore", "Maryland", "211223", NULL, NULL, "321394", "234523");

INSERT INTO Client(Client_Num, Client_Name, Client_Email, Maxium_Willing_Rent, Property_Pref, Client_Street, Client_City, 
                   Client_State, Client_Zip_Code, Client_Unit_Num, Client_Home_Phone, Client_Work_Phone, Client_Mobile_Phone) 
VALUES(10, "Cem Vega", "cvega@umbc.edu", 1043200, "Industrial", "103 J Street", "Baltimore", "Maryland", "211223", NULL, NULL, "3362", "2378");

INSERT INTO Client(Client_Num, Client_Name, Client_Email, Maxium_Willing_Rent, Property_Pref, Client_Street, Client_City, 
                   Client_State, Client_Zip_Code, Client_Unit_Num, Client_Home_Phone, Client_Work_Phone, Client_Mobile_Phone) 
VALUES(11, "Aiysha Gamble", "agamble@umbc.edu", 140500, "Industrial", "987 K Street", "Baltimore", "Maryland", "211223", NULL, NULL, "334552", "687323");

INSERT INTO Client(Client_Num, Client_Name, Client_Email, Maxium_Willing_Rent, Property_Pref, Client_Street, Client_City, 
                   Client_State, Client_Zip_Code, Client_Unit_Num, Client_Home_Phone, Client_Work_Phone, Client_Mobile_Phone) 
VALUES(12, "Kasim Milne", "kmilne@umbc.edu", 96000, "Industrial", "987 I Street", "Baltimore", "Maryland", "211223", NULL, NULL, "32952", "232303");

-- 6 private owners 
INSERT INTO Property_Owner(Owner_Num, Employee_Num, Owner_Name, Owner_Email,  Owner_Street,Owner_City,
						   Owner_State, Owner_Zip_Code, Owner_Unit_Num, Owner_Home_Phone, Owner_Work_Phone, Owner_Mobile_Phone)
VALUES(1, 4,"Henry White", "hwhite@umbc.edu", "525 J Road", "Baltimore", "Maryland", 212223, 7, NULL, 23455, NULL);

INSERT INTO Property_Owner(Owner_Num, Employee_Num, Owner_Name, Owner_Email,  Owner_Street,Owner_City,
						   Owner_State, Owner_Zip_Code, Owner_Unit_Num, Owner_Home_Phone, Owner_Work_Phone, Owner_Mobile_Phone)
VALUES(2, 4,"Cindy Morse", "cMorse@umbc.edu", "5253 K Road", "Baltimore", "Maryland", 212223, 44, NULL, 424244, NULL);

INSERT INTO Property_Owner(Owner_Num, Employee_Num, Owner_Name, Owner_Email,  Owner_Street,Owner_City,
						   Owner_State, Owner_Zip_Code, Owner_Unit_Num, Owner_Home_Phone, Owner_Work_Phone, Owner_Mobile_Phone)
VALUES(3, 5,"Eleni Cohen", "eCohen@umbc.edu", "35 L Road", "Baltimore", "Maryland", 212223, NULL, NULL, NULL, 41445);

INSERT INTO Property_Owner(Owner_Num, Employee_Num, Owner_Name, Owner_Email,  Owner_Street,Owner_City,
						   Owner_State, Owner_Zip_Code, Owner_Unit_Num, Owner_Home_Phone, Owner_Work_Phone, Owner_Mobile_Phone)
VALUES(4, 5,"Pat Doe", "pDoe@umbc.edu", "525 M Road", "Baltimore", "Maryland", 212223, NULL, 13456, NULL, 24244);

INSERT INTO Property_Owner(Owner_Num, Employee_Num, Owner_Name, Owner_Email,  Owner_Street,Owner_City,
						   Owner_State, Owner_Zip_Code, Owner_Unit_Num, Owner_Home_Phone, Owner_Work_Phone, Owner_Mobile_Phone)
VALUES(5, 6,"Jonah Ho", "jho@umbc.edu", "525 N Road", "Baltimore", "Maryland", 212223, NULL, NULL, 3636, NULL);

INSERT INTO Property_Owner(Owner_Num, Employee_Num, Owner_Name, Owner_Email,  Owner_Street,Owner_City,
						   Owner_State, Owner_Zip_Code, Owner_Unit_Num, Owner_Home_Phone, Owner_Work_Phone, Owner_Mobile_Phone)
VALUES(6, 6,"Derek Burn", "dburn@umbc.edu", "525 O Road", "Baltimore", "Maryland", 212223, 4, 152, NULL, 5355);

-- 6 properties of each type 
INSERT INTO Rental_Properties(Property_Num, Property_Name, Area_Square_Footing, Monthly_Manage_Fee, Advertised, Property_Type, 
							  Property_Street, Property_City, Property_State, Property_Zip_Code, Property_Unit_Num)
VALUES(1, "Oak Hill", 13300, 10000,True, "Residential" , "234 A street", "Baltimore", "Maryland", "212223", 4);

INSERT INTO Rental_Properties(Property_Num, Property_Name, Area_Square_Footing, Monthly_Manage_Fee, Advertised, Property_Type,
							  Property_Street, Property_City, Property_State, Property_Zip_Code, Property_Unit_Num)
VALUES(2, "Willow Hill", 24500, 50000, True,"Residential", "2445 B street", "Baltimore", "Maryland", "212223", 1);

INSERT INTO Rental_Properties(Property_Num, Property_Name, Area_Square_Footing, Monthly_Manage_Fee, Advertised, Property_Type,
							  Property_Street, Property_City, Property_State, Property_Zip_Code, Property_Unit_Num)
VALUES(3, "Honey Hill", 11450, 102450,  True,"Residential", "3 C street", "Baltimore", "Maryland", "212223", 2);

INSERT INTO Rental_Properties(Property_Num, Property_Name, Area_Square_Footing, Monthly_Manage_Fee, Advertised, Property_Type,
							  Property_Street, Property_City, Property_State, Property_Zip_Code, Property_Unit_Num)
VALUES(4, "Coco Hill", 13300, 20000,  True, "Residential",  "4 D street", "Baltimore", "Maryland", "212223", 3);

INSERT INTO Rental_Properties(Property_Num, Property_Name, Area_Square_Footing, Monthly_Manage_Fee, Advertised, Property_Type,
							  Property_Street, Property_City, Property_State, Property_Zip_Code, Property_Unit_Num)
VALUES(5, "Ash Hill", 25000, 30000, True, "Residential","6 F street", "Baltimore", "Maryland", "212223", 5);

INSERT INTO Rental_Properties(Property_Num, Property_Name, Area_Square_Footing, Monthly_Manage_Fee, Advertised, Property_Type,
							  Property_Street, Property_City, Property_State, Property_Zip_Code, Property_Unit_Num)
VALUES(6, "Bay Hill", 45000, 40000,  True, "Residential", "7 G street", "Baltimore", "Maryland", "212223", 6);

INSERT INTO Rental_Properties(Property_Num, Property_Name, Area_Square_Footing, Monthly_Manage_Fee, Advertised, Property_Type,
							  Property_Street, Property_City, Property_State, Property_Zip_Code, Property_Unit_Num)
VALUES(7, "Rubber Hill", 35000, 50000,  True, "Commerical", "8 H street", "Baltimore", "Maryland", "212223", 7);

INSERT INTO Rental_Properties(Property_Num, Property_Name, Area_Square_Footing, Monthly_Manage_Fee, Advertised, Property_Type,
							  Property_Street, Property_City, Property_State, Property_Zip_Code, Property_Unit_Num)
VALUES(8, "Fig Hill", 55000, 25000,  True, "Commerical", "9 I street", "Baltimore", "Maryland", "212223", 8);

INSERT INTO Rental_Properties(Property_Num, Property_Name, Area_Square_Footing, Monthly_Manage_Fee, Advertised, Property_Type,
							  Property_Street, Property_City, Property_State, Property_Zip_Code, Property_Unit_Num)
VALUES(9, "Locust Hill", 50000, 35000, True, "Commerical", "10 J street", "Baltimore", "Maryland", "212223", 9);

INSERT INTO Rental_Properties(Property_Num, Property_Name, Area_Square_Footing, Monthly_Manage_Fee, Advertised, Property_Type,
							  Property_Street, Property_City, Property_State, Property_Zip_Code, Property_Unit_Num)
VALUES(10, "American Hill", 60000, 45000, False, "Commerical", "11 K street", "Baltimore", "Maryland", "212223", 10);

INSERT INTO Rental_Properties(Property_Num, Property_Name, Area_Square_Footing, Monthly_Manage_Fee, Advertised, Property_Type,
							  Property_Street, Property_City, Property_State, Property_Zip_Code, Property_Unit_Num)
VALUES(11, "Dragon Hill", 70000, 55000, False,"Commerical", "12 L street", "Baltimore", "Maryland", "212223", 11);

INSERT INTO Rental_Properties(Property_Num, Property_Name, Area_Square_Footing, Monthly_Manage_Fee, Advertised, Property_Type,
							  Property_Street, Property_City, Property_State, Property_Zip_Code, Property_Unit_Num)
VALUES(12, "Tree Hill", 80000, 65000, False, "Commerical", "13 M street", "Baltimore", "Maryland", "212223", 12);

INSERT INTO Rental_Properties(Property_Num, Property_Name, Area_Square_Footing, Monthly_Manage_Fee, Advertised, Property_Type,
							  Property_Street, Property_City, Property_State, Property_Zip_Code, Property_Unit_Num)
VALUES(13, "Beech Hill", 45000, 75000, False, "Industrial", "14 N street", "Baltimore", "Maryland", "212223", 13);

INSERT INTO Rental_Properties(Property_Num, Property_Name, Area_Square_Footing, Monthly_Manage_Fee, Advertised, Property_Type,
							  Property_Street, Property_City, Property_State, Property_Zip_Code, Property_Unit_Num)
VALUES(14, "Black Hill", 32000, 85000, False, "Industrial", "15 O street", "Baltimore", "Maryland", "212223", 14);

INSERT INTO Rental_Properties(Property_Num, Property_Name, Area_Square_Footing, Monthly_Manage_Fee, Advertised, Property_Type,
							  Property_Street, Property_City, Property_State, Property_Zip_Code, Property_Unit_Num)
VALUES(15, "White Hill", 43000, 95000, False, "Industrial", "16 P street", "Baltimore", "Maryland", "212223", 15);

INSERT INTO Rental_Properties(Property_Num, Property_Name, Area_Square_Footing, Monthly_Manage_Fee, Advertised, Property_Type,
							  Property_Street, Property_City, Property_State, Property_Zip_Code, Property_Unit_Num)
VALUES(16, "Grey Hill", 40500, 100000, False, "Industrial", "17 Q street", "Baltimore", "Maryland", "212223", 16);

INSERT INTO Rental_Properties(Property_Num, Property_Name, Area_Square_Footing, Monthly_Manage_Fee, Advertised, Property_Type,
							  Property_Street, Property_City, Property_State, Property_Zip_Code, Property_Unit_Num)
VALUES(17, "Blue Hill", 190000, 1000, False, "Industrial","18 P street", "Baltimore", "Maryland", "212223", 17);

INSERT INTO Rental_Properties(Property_Num, Property_Name, Area_Square_Footing, Monthly_Manage_Fee, Advertised, Property_Type,
							  Property_Street, Property_City, Property_State, Property_Zip_Code, Property_Unit_Num)
VALUES(18, "Red Hill", 150000, 980000, False, "Industrial", "19 Q street", "Baltimore", "Maryland", "212223", 18);

-- 6 Residential
INSERT INTO Residential(Property_Num, Property_Name, Bathroom_Num, Bedroom_Num)
VALUES(1, "Oak Hill", 2, 2); 

INSERT INTO Residential(Property_Num, Property_Name, Bathroom_Num, Bedroom_Num)
VALUES(2, "Willow Hill", 4, 3); 

INSERT INTO Residential(Property_Num, Property_Name, Bathroom_Num, Bedroom_Num)
VALUES(3, "Honey Hill", 5, 3); 

INSERT INTO Residential(Property_Num, Property_Name, Bathroom_Num, Bedroom_Num)
VALUES(4, "Coco Hill", 3, 3); 

INSERT INTO Residential(Property_Num, Property_Name, Bathroom_Num, Bedroom_Num)
VALUES(5, "Ash Hill", 4, 4); 

INSERT INTO Residential(Property_Num, Property_Name, Bathroom_Num, Bedroom_Num)
VALUES(6, "Bay Hill", 5, 5); 

-- 6 Commerical 
INSERT INTO Commerical(Property_Num, Property_Name, Coperation_Name)
VALUES(7, "Rubber Hill", "Burger King");

INSERT INTO Commerical(Property_Num, Property_Name, Coperation_Name)
VALUES(8, "Fig Hill", "Burger King");

INSERT INTO Commerical(Property_Num, Property_Name, Coperation_Name)
VALUES(9, "Locust Hill", "Five Guys");

INSERT INTO Commerical(Property_Num, Property_Name, Coperation_Name)
VALUES(10, "American Hill", "Five Guys");

INSERT INTO Commerical(Property_Num, Property_Name, Coperation_Name)
VALUES(11, "Dragon Hill", "KFC");

INSERT INTO Commerical(Property_Num, Property_Name, Coperation_Name)
VALUES(12, "Tree Hill", "KFC");

-- 6 Industrial properties  
INSERT INTO Industrial(Property_Num, Property_Name, Industrial_Name)
VALUES(13, "Beech Hill", "Amazon");

INSERT INTO Industrial(Property_Num, Property_Name, Industrial_Name)
VALUES(14, "Black Hill", "Amazon");

INSERT INTO Industrial(Property_Num, Property_Name, Industrial_Name)
VALUES(15, "White Hill", "Apple");

INSERT INTO Industrial(Property_Num, Property_Name, Industrial_Name)
VALUES(16, "Grey Hill", "Apple");

INSERT INTO Industrial(Property_Num, Property_Name, Industrial_Name)
VALUES(17, "Blue Hill", "Microsoft");

INSERT INTO Industrial(Property_Num, Property_Name, Industrial_Name)
VALUES(18, "Red Hill", "Microsoft");

-- 12 property viewing 
INSERT INTO Property_Viewing(Property_Num, Property_Name, Viewing_Date, Viewing_Time)
VALUES(1, "Oak Hill", "2020-06-15", "6:00:00");

INSERT INTO Property_Viewing(Property_Num, Property_Name, Viewing_Date, Viewing_Time)
VALUES(1, "Oak Hill", "2020-06-15", "7:00:00");

INSERT INTO Property_Viewing(Property_Num, Property_Name, Viewing_Date, Viewing_Time)
VALUES(1, "Oak Hill", "2020-06-15", "8:00:00");

INSERT INTO Property_Viewing(Property_Num, Property_Name, Viewing_Date, Viewing_Time)
VALUES(1, "Oak Hill", "2020-06-15", "9:00:00");

INSERT INTO Property_Viewing(Property_Num, Property_Name, Viewing_Date, Viewing_Time)
VALUES(1, "Oak Hill", "2020-06-16", "10:00:00");

INSERT INTO Property_Viewing(Property_Num, Property_Name, Viewing_Date, Viewing_Time)
VALUES(2, "Willow Hill", "2020-06-16", "7:00:00");

INSERT INTO Property_Viewing(Property_Num, Property_Name, Viewing_Date, Viewing_Time)
VALUES(2, "Willow Hill", "2020-06-16", "8:00:00");

INSERT INTO Property_Viewing(Property_Num, Property_Name, Viewing_Date, Viewing_Time)
VALUES(2, "Willow Hill", "2020-06-16", "9:00:00");

INSERT INTO Property_Viewing(Property_Num, Property_Name, Viewing_Date, Viewing_Time)
VALUES(3, "Honey Hill", "2020-06-17", "6:00:00");

INSERT INTO Property_Viewing(Property_Num, Property_Name, Viewing_Date, Viewing_Time)
VALUES(3, "Honey Hill", "2020-06-17", "7:00:00");

INSERT INTO Property_Viewing(Property_Num, Property_Name, Viewing_Date, Viewing_Time)
VALUES(3, "Honey Hill", "2020-06-18", "8:00:00");

INSERT INTO Property_Viewing(Property_Num, Property_Name, Viewing_Date, Viewing_Time)
VALUES(3, "Honey Hill", "2020-06-18", "9:00:00");

-- 6 Leaseas
INSERT INTO Lease(Lease_Num, Lease_Date, Lease_Deposit, Lease_Monthly_Rent, Lease_Start_Date, Lease_End_Date) 
VALUES(1, "2020-06-15", 4000, 1200,"2020-06-16", "2020-10-16");

INSERT INTO Lease(Lease_Num, Lease_Date, Lease_Deposit, Lease_Monthly_Rent, Lease_Start_Date, Lease_End_Date) 
VALUES(2, "2020-05-15", 5000, 1200,"2020-05-16", "2020-09-16");

INSERT INTO Lease(Lease_Num, Lease_Date, Lease_Deposit, Lease_Monthly_Rent, Lease_Start_Date, Lease_End_Date) 
VALUES(3, "2020-04-15", 6000, 1200,"2020-04-16", "2020-08-16");

INSERT INTO Lease(Lease_Num, Lease_Date, Lease_Deposit, Lease_Monthly_Rent, Lease_Start_Date, Lease_End_Date) 
VALUES(4, "2020-03-15", 8000, 1200,"2020-03-16", "2020-07-16");

INSERT INTO Lease(Lease_Num, Lease_Date, Lease_Deposit, Lease_Monthly_Rent, Lease_Start_Date, Lease_End_Date) 
VALUES(5, "2020-07-15", 7000, 6200,"2020-07-16", "2020-11-16");

INSERT INTO Lease(Lease_Num, Lease_Date, Lease_Deposit, Lease_Monthly_Rent, Lease_Start_Date, Lease_End_Date) 
VALUES(6, "2020-08-15", 9000, 7200,"2020-08-16", "2020-12-16");

-- Arranges Relationship 
INSERT INTO Arranges(Employee_Num, Employee_Name, Property_Num, Property_Name, Viewing_Date, Viewing_Time) 
VALUES(1, "John Bill", 1 , "Oak Hill", "2020-06-15", "6:00:00");

INSERT INTO Arranges(Employee_Num, Employee_Name, Property_Num, Property_Name, Viewing_Date, Viewing_Time) 
VALUES(1, "John Bill" ,1 , "Oak Hill", "2020-06-15", "7:00:00");

INSERT INTO Arranges(Employee_Num, Employee_Name, Property_Num, Property_Name, Viewing_Date, Viewing_Time) 
VALUES(1, "John Bill" ,1 , "Oak Hill", "2020-06-15", "8:00:00");

INSERT INTO Arranges(Employee_Num, Employee_Name, Property_Num, Property_Name, Viewing_Date, Viewing_Time) 
VALUES(1, "John Bill" ,1 , "Oak Hill", "2020-06-15", "9:00:00");

INSERT INTO Arranges(Employee_Num, Employee_Name, Property_Num, Property_Name, Viewing_Date, Viewing_Time) 
VALUES(2, "Bob Bell" , 2 , "Willow Hill", "2020-06-15", "6:00:00");

INSERT INTO Arranges(Employee_Num, Employee_Name, Property_Num, Property_Name, Viewing_Date, Viewing_Time) 
VALUES(2, "Bob Bell" , 2 , "Willow Hill", "2020-06-15", "7:00:00");

INSERT INTO Arranges(Employee_Num, Employee_Name, Property_Num, Property_Name, Viewing_Date, Viewing_Time) 
VALUES(2, "Bob Bell" , 2 , "Willow Hill", "2020-06-15", "8:00:00");

INSERT INTO Arranges(Employee_Num, Employee_Name, Property_Num, Property_Name, Viewing_Date, Viewing_Time) 
VALUES(2, "Bob Bell" , 2 , "Willow Hill", "2020-06-15", "9:00:00");

INSERT INTO Arranges(Employee_Num, Employee_Name, Property_Num, Property_Name, Viewing_Date, Viewing_Time) 
VALUES(3, "Jimmy Red" , 3 , "Willow Hill", "2020-06-15", "6:00:00");

INSERT INTO Arranges(Employee_Num, Employee_Name, Property_Num, Property_Name, Viewing_Date, Viewing_Time) 
VALUES(3, "Jimmy Red" , 3 , "Willow Hill", "2020-06-15", "7:00:00");

INSERT INTO Arranges(Employee_Num, Employee_Name, Property_Num, Property_Name, Viewing_Date, Viewing_Time) 
VALUES(3, "Jimmy Red" , 3 , "Willow Hill", "2020-06-15", "8:00:00");

INSERT INTO Arranges(Employee_Num, Employee_Name, Property_Num, Property_Name, Viewing_Date, Viewing_Time) 
VALUES(3, "Jimmy Red" , 3 , "Willow Hill", "2020-06-15", "9:00:00");

-- Assigned Partner
INSERT INTO Assigned_Partner(Employee_Num, Employee_Name, Owner_Num, Owner_Name)
VALUES(4, "Sam Green", 1, "Henry White");

INSERT INTO Assigned_Partner(Employee_Num, Employee_Name, Owner_Num, Owner_Name)
VALUES(4, "Sam Green", 2, "Cindy Morse");

INSERT INTO Assigned_Partner(Employee_Num, Employee_Name, Owner_Num, Owner_Name)
VALUES(5, "Quinn Blue", 3, "Eleni Cohen");

INSERT INTO Assigned_Partner(Employee_Num, Employee_Name, Owner_Num, Owner_Name)
VALUES(5, "Quinn Blue", 4, "Pat Doe");

INSERT INTO Assigned_Partner(Employee_Num, Employee_Name, Owner_Num, Owner_Name)
VALUES(6, "Tom Pink", 5, "Johan Ho");

INSERT INTO Assigned_Partner(Employee_Num, Employee_Name, Owner_Num, Owner_Name)
VALUES(6, "Tom Pink", 6, "Derek Burn");

-- Assigned Property
INSERT INTO Assigned_Property(Employee_Num, Employee_Name,Property_Num , Property_Name, Property_Status)
VALUES(1, "John Bill", 1, "Oak Hill",True);

INSERT INTO Assigned_Property(Employee_Num, Employee_Name,Property_Num , Property_Name, Property_Status)
VALUES(1, "John Bill", 2, "Willow Hill",True);

INSERT INTO Assigned_Property(Employee_Num, Employee_Name,Property_Num , Property_Name, Property_Status)
VALUES(1, "John Bill", 3, "Honey Hill",True);

INSERT INTO Assigned_Property(Employee_Num, Employee_Name,Property_Num , Property_Name, Property_Status)
VALUES(1, "John Bill", 4, "Coco Hill",True);

INSERT INTO Assigned_Property(Employee_Num, Employee_Name,Property_Num , Property_Name, Property_Status)
VALUES(2, "Bob Bell", 5, "Ash Hill",True);

INSERT INTO Assigned_Property(Employee_Num, Employee_Name,Property_Num , Property_Name, Property_Status)
VALUES(2, "Bob Bell", 6, "Bay Hill",True);

INSERT INTO Assigned_Property(Employee_Num, Employee_Name,Property_Num , Property_Name, Property_Status)
VALUES(2, "Bob Bell", 7, "Rubber Hill",True);

INSERT INTO Assigned_Property(Employee_Num, Employee_Name,Property_Num , Property_Name, Property_Status)
VALUES(2, "Bob Bell", 8, "Fig Hill",True);

INSERT INTO Assigned_Property(Employee_Num, Employee_Name,Property_Num , Property_Name, Property_Status)
VALUES(3, "Jimmy Red", 9, "Locust Hill",True);

INSERT INTO Assigned_Property(Employee_Num, Employee_Name,Property_Num , Property_Name, Property_Status)
VALUES(3, "Jimmy Red", 10, "American Hill",True);

INSERT INTO Assigned_Property(Employee_Num, Employee_Name,Property_Num , Property_Name, Property_Status)
VALUES(3, "Jimmy Red", 11, "Dragon Hill",True);

INSERT INTO Assigned_Property(Employee_Num, Employee_Name,Property_Num , Property_Name, Property_Status)
VALUES(3, "Jimmy Red", 12, "Tree Hill",True);

INSERT INTO Assigned_Property(Employee_Num, Employee_Name,Property_Num , Property_Name, Property_Status)
VALUES(1, "John Bill", 13, "Beech Hill Hill",True);

INSERT INTO Assigned_Property(Employee_Num, Employee_Name,Property_Num , Property_Name, Property_Status)
VALUES(1, "John Bill", 14, "Black Hill",True);

INSERT INTO Assigned_Property(Employee_Num, Employee_Name,Property_Num , Property_Name, Property_Status)
VALUES(1, "John Bill", 15, "White Hill",True);

INSERT INTO Assigned_Property(Employee_Num, Employee_Name,Property_Num , Property_Name, Property_Status)
VALUES(1, "John Bill", 16, "Grey Hill",True);

INSERT INTO Assigned_Property(Employee_Num, Employee_Name,Property_Num , Property_Name, Property_Status)
VALUES(1, "John Bill", 17, "Blue Hill",True);

INSERT INTO Assigned_Property(Employee_Num, Employee_Name,Property_Num , Property_Name, Property_Status)
VALUES(1, "John Bill", 18, "Red Hill",True);

-- Contract
INSERT INTO Contract(Lease_Num, Property_Name, Property_Num)
VALUES(1, "Ash Hill", 5); 

INSERT INTO Contract(Lease_Num, Property_Name, Property_Num)
VALUES(2, "Bay Hill", 6); 

INSERT INTO Contract(Lease_Num, Property_Name, Property_Num)
VALUES(3, "Rubber Hill", 7); 

INSERT INTO Contract(Lease_Num, Property_Name, Property_Num)
VALUES(4, "Fig Hill", 8); 

INSERT INTO Contract(Lease_Num, Property_Name, Property_Num)
VALUES(5, "Locust Hill", 9); 

INSERT INTO Contract(Lease_Num, Property_Name, Property_Num)
VALUES(6, "American Hill", 10); 

-- Owned By
INSERT INTO Owned_By(Property_Num, Property_Name, Owner_Num, Owner_Name) 
VALUES( 1, "Oak Hill", 1, "Henry White");

INSERT INTO Owned_By(Property_Num, Property_Name, Owner_Num, Owner_Name) 
VALUES( 2, "Willow Hill", 1, "Henry White");

INSERT INTO Owned_By(Property_Num, Property_Name, Owner_Num, Owner_Name) 
VALUES( 3, "Honey Hill", 1, "Henry White");

INSERT INTO Owned_By(Property_Num, Property_Name, Owner_Num, Owner_Name) 
VALUES( 4, "Coco Hill", 2, "Cindy Morse");

INSERT INTO Owned_By(Property_Num, Property_Name, Owner_Num, Owner_Name) 
VALUES( 5, "Ash", 2, "Cindy Morse");

INSERT INTO Owned_By(Property_Num, Property_Name, Owner_Num, Owner_Name) 
VALUES( 6, "Bay Hill", 2, "Cindy Morse");

INSERT INTO Owned_By(Property_Num, Property_Name, Owner_Num, Owner_Name) 
VALUES( 7, "Rubber Hill", 3, "Eleni Cohen");

INSERT INTO Owned_By(Property_Num, Property_Name, Owner_Num, Owner_Name) 
VALUES( 8, "Fig Hill", 3, "Eleni Cohen");

INSERT INTO Owned_By(Property_Num, Property_Name, Owner_Num, Owner_Name) 
VALUES( 9, "Locust Hill", 3, "Eleni Cohen");

INSERT INTO Owned_By(Property_Num, Property_Name, Owner_Num, Owner_Name) 
VALUES( 10, "American Hill", 4, "Pat Doe");

INSERT INTO Owned_By(Property_Num, Property_Name, Owner_Num, Owner_Name) 
VALUES( 11, "Dragon Hill", 4, "Pat Doe");

INSERT INTO Owned_By(Property_Num, Property_Name, Owner_Num, Owner_Name) 
VALUES( 12, "Tree Hill", 4, "Pat Doe");

INSERT INTO Owned_By(Property_Num, Property_Name, Owner_Num, Owner_Name) 
VALUES( 13, "Beech Hill", 5, "Johan Ho");

INSERT INTO Owned_By(Property_Num, Property_Name, Owner_Num, Owner_Name) 
VALUES( 14, "Black Hill", 5, "Johan Ho");

INSERT INTO Owned_By(Property_Num, Property_Name, Owner_Num, Owner_Name) 
VALUES( 15, "White Hill", 5, "Johan Ho");

INSERT INTO Owned_By(Property_Num, Property_Name, Owner_Num, Owner_Name) 
VALUES( 16, "Grey Hill", 6, "Derek Burn");

INSERT INTO Owned_By(Property_Num, Property_Name, Owner_Num, Owner_Name) 
VALUES( 17, "Blue Hill", 6, "Derek Burn");

INSERT INTO Owned_By(Property_Num, Property_Name, Owner_Num, Owner_Name) 
VALUES( 18, "Red Hill", 6, "Derek Burn");

-- Tours 
INSERT INTO Tours(Owner_Num, Owner_Name, Property_Num, Property_Name, Tour_Date, Tour_Time)
VALUES(1, "Henry White", 1, "Oak Hill", "2020-06-15", "06:00:00");

INSERT INTO Tours(Owner_Num, Owner_Name, Property_Num, Property_Name, Tour_Date, Tour_Time)
VALUES(1, "Henry White", 1, "Oak Hill", "2020-06-15", "07:00:00");

INSERT INTO Tours(Owner_Num, Owner_Name, Property_Num, Property_Name, Tour_Date, Tour_Time)
VALUES(1, "Henry White", 1, "Oak Hill", "2020-06-15", "08:00:00");

INSERT INTO Tours(Owner_Num, Owner_Name, Property_Num, Property_Name, Tour_Date, Tour_Time)
VALUES(1, "Henry White", 1, "Oak Hill", "2020-06-15", "09:00:00");

INSERT INTO Tours(Owner_Num, Owner_Name, Property_Num, Property_Name, Tour_Date, Tour_Time)
VALUES(1, "Henry White", 2, "Willow Hill", "2020-06-16", "06:00:00");

INSERT INTO Tours(Owner_Num, Owner_Name, Property_Num, Property_Name, Tour_Date, Tour_Time)
VALUES(1, "Henry White", 2, "Willow Hill", "2020-06-16", "07:00:00");

INSERT INTO Tours(Owner_Num, Owner_Name, Property_Num, Property_Name, Tour_Date, Tour_Time)
VALUES(1, "Henry White", 2, "Willow Hill", "2020-06-16", "08:00:00");

INSERT INTO Tours(Owner_Num, Owner_Name, Property_Num, Property_Name, Tour_Date, Tour_Time)
VALUES(1, "Henry White", 2, "Willow Hill", "2020-06-16", "09:00:00");

INSERT INTO Tours(Owner_Num, Owner_Name, Property_Num, Property_Name, Tour_Date, Tour_Time)
VALUES(1, "Henry White", 3, "Honey Hill", "2020-06-17", "06:00:00");

INSERT INTO Tours(Owner_Num, Owner_Name, Property_Num, Property_Name, Tour_Date, Tour_Time)
VALUES(1, "Henry White", 3, "Honey Hill", "2020-06-17", "07:00:00");

INSERT INTO Tours(Owner_Num, Owner_Name, Property_Num, Property_Name, Tour_Date, Tour_Time)
VALUES(1, "Henry White", 3, "Honey Hill", "2020-06-17", "08:00:00");

INSERT INTO Tours(Owner_Num, Owner_Name, Property_Num, Property_Name, Tour_Date, Tour_Time)
VALUES(1, "Henry White", 3, "Honey Hill", "2020-06-17", "09:00:00");

-- Views 
INSERT INTO Views(Client_Num, Client_Name, Property_Num, Property_Name, View_Date, View_Time)
VALUES(1, "Stan Brown", 1, "Oak Hill", "2020-06-15", "06:00:00");

INSERT INTO Views(Client_Num, Client_Name, Property_Num, Property_Name, View_Date, View_Time)
VALUES(2, "James Pro", 1, "Oak Hill", "2020-06-15", "07:00:00");

INSERT INTO Views(Client_Num, Client_Name, Property_Num, Property_Name, View_Date, View_Time)
VALUES(3, "Lance Bo", 1, "Oak Hill", "2020-06-15", "08:00:00");

INSERT INTO Views(Client_Num, Client_Name, Property_Num, Property_Name, View_Date, View_Time)
VALUES(4, "Nanes Po", 1, "Oak Hill", "2020-06-15", "09:00:00");

INSERT INTO Views(Client_Num, Client_Name, Property_Num, Property_Name, View_Date, View_Time)
VALUES(5, "Krames Taq", 2, "Willow Hill", "2020-06-16", "06:00:00");

INSERT INTO Views(Client_Num, Client_Name, Property_Num, Property_Name, View_Date, View_Time)
VALUES(6, "Ame Un", 2, "Willow Hill", "2020-06-16", "07:00:00");

INSERT INTO Views(Client_Num, Client_Name, Property_Num, Property_Name, View_Date, View_Time)
VALUES(7, "Suzanne Joseph", 2, "Willow Hill", "2020-06-16", "08:00:00");

INSERT INTO Views(Client_Num, Client_Name, Property_Num, Property_Name, View_Date, View_Time)
VALUES(8, "Valention Castro", 2, "Willow Hill", "2020-06-16", "09:00:00");

INSERT INTO Views(Client_Num, Client_Name, Property_Num, Property_Name, View_Date, View_Time)
VALUES(9, "Bethany Devlin", 3, "Honey Hill", "2020-06-17", "06:00:00");

INSERT INTO Views(Client_Num, Client_Name, Property_Num, Property_Name, View_Date, View_Time)
VALUES(10, "Cem Vega", 3, "Honey Hill", "2020-06-17", "07:00:00");

INSERT INTO Views(Client_Num, Client_Name, Property_Num, Property_Name, View_Date, View_Time)
VALUES(11, "Aiysha Gamble", 3, "Honey Hill", "2020-06-17", "08:00:00");

INSERT INTO Views(Client_Num, Client_Name, Property_Num, Property_Name, View_Date, View_Time)
VALUES(12, "Kasim Milne", 3, "Honey Hill", "2020-06-17", "09:00:00");

-- Signs Leases
INSERT INTO Sign_Lease(Client_Num, Client_Name, Lease_Num)
VALUES(1, "Stan Brown", 1); 

INSERT INTO Sign_Lease(Client_Num, Client_Name, Lease_Num)
VALUES(1, "Stan Brown", 2); 

INSERT INTO Sign_Lease(Client_Num, Client_Name, Lease_Num)
VALUES(1, "Stan Brown", 3); 

INSERT INTO Sign_Lease(Client_Num, Client_Name, Lease_Num)
VALUES(1, "Stan Brown", 4); 

INSERT INTO Sign_Lease(Client_Num, Client_Name, Lease_Num)
VALUES(1, "Stan Brown", 5); 

INSERT INTO Sign_Lease(Client_Num, Client_Name, Lease_Num)
VALUES(1, "Stan Brown", 6); 

-- Writes Lease 
INSERT INTO Writes_Lease(Employee_Num, Employee_Name, Lease_Num)
VALUES(1, "John Bill", 1); 

INSERT INTO Writes_Lease(Employee_Num, Employee_Name, Lease_Num)
VALUES(1, "John Bill", 2); 

INSERT INTO Writes_Lease(Employee_Num, Employee_Name, Lease_Num)
VALUES(2, "Bob Bell", 3); 

INSERT INTO Writes_Lease(Employee_Num, Employee_Name, Lease_Num)
VALUES(2, "Bob Bell", 4); 

INSERT INTO Writes_Lease(Employee_Num, Employee_Name, Lease_Num)
VALUES(3, "Jimmy Red", 5); 

INSERT INTO Writes_Lease(Employee_Num, Employee_Name, Lease_Num)
VALUES(3, "Bob Bell", 6);

 * mysql+mysqlconnector://bryan:***@localhost:3306/projectdb
   sqlite:///test.sqlite
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

## Sample Parameters for Input Script 
<b>For each entity and relationship, the following below is the sample parameters for each of them </b>

### Entities 
<b>Entity: Employees</b> <br>
Employee(Employee_Num, Supervisor_Num, Employee_Name, Employee_Email, Employee_Street, Employee_City, Employee_State, Employee_Zip_Code, Employee_Unit_Num, Employee_Home_Phone, Employee_Work_Phone, Employee_Mobile_Phone)

<b>Entity: Associates</b> <br>
Associates(Employee_Num, Employee_Name, Property_Amount) 

<b>Entity: Partners</b> <br>
Partners(Employee_Num, Employee_Name, Property_Owner_Num)

<b>Entity: Client</b> <br>
Client(Client_Num, Client_Name, Client_Email, Maxium_Willing_Rent, Property_Pref, Client_Street, Client_City, 
Client_State, Client_Zip_Code, Client_Unit_Num, Client_Home_Phone, Client_Work_Phone, Client_Mobile_Phone) 

<b>Entity: Property_Owner</b> <br>
Property_Owner(Owner_Num, Employee_Num, Owner_Name, Owner_Email,  Owner_Street,Owner_City,
Owner_State, Owner_Zip_Code, Owner_Unit_Num, Owner_Home_Phone, Owner_Work_Phone, Owner_Mobile_Phone)

<b>Entity: Rental_Properties</b> <br>
Rental_Properties(Property_Num, Property_Name, Area_Square_Footing, Monthly_Manage_Fee, Advertised, 
Property_Street, Property_City, Property_State, Property_Zip_Code, Property_Unit_Num)

<b>Entity: Residential </b> <br>
Residential(Property_Num, Property_Name, Bathroom_Num, Bedroom_Num)

<b>Entity: Commerical </b> <br> 
Commerical(Property_Num, Property_Name, Coperation_Name)

<b>Entity: Industrial </b> <br>
Industrial(Property_Num, Property_Name, Industrial_Name)

<b>Entity: Property_Viewing </b> <br>
Property_Viewing(Property_Num, Property_Name, Viewing_Date, Viewing_Time)

<b>Entity: Lease </b> <br>
Lease(Lease_Num, Lease_Date, Lease_Deposit, Lease_Monthly_Rent, Lease_Start_Date, Lease_End_Date)

### Relationships
<b> Relationship: Arranges </b> <br> 
Arranges(Employee_Num, Employee_Name, Property_Num, Property_Name, Viewing_Date, Viewing_Time) 

<b> Relationship: Assigned_Partner </b> <br>
Assigned_Partner(Employee_Num, Employee_Name, Owner_Num, Owner_Name)

<b> Relationship: Assigned_Properties </b> <br> 
Assigned_Property(Employee_Num, Employee_Name,Property_Num , Property_Name, Property_Status)

<b> Relationship: Contract </b> <br>
Contract(Lease_Num, Property_Name, Property_Num)

<b> Relationship: Owned_By </b> <br>
Owned_By(Property_Num, Property_Name, Owner_Num, Owner_Name) 

<b> Relationship: Tours </b> <br> 
Tours(Owner_Num, Owner_Name, Property_Num, Property_Name, Tour_Date, Tour_Time)

<b> Relationship: Views </b> <br>
Views(Client_Num, Client_Name, Property_Num, Property_Name, View_Date, View_Time) 

<b> Relationship: Sign_Lease </b> <br>
Sign_Lease(Client_Num, Client_Name, Lease_Num)

<b> Relationship: Writes_Lease </b> <br> 
Writes_Lease(Employee_Num, Employee_Name, Lease_Num)

# Test Queries
To see if the data insertions worked correctly <br>

## Queries for the Main Entities

In [5]:
%%sql 

SELECT * 
FROM Employee;

 * mysql+mysqlconnector://bryan:***@localhost:3306/projectdb
   sqlite:///test.sqlite
6 rows affected.

[(1, 1, 'John Bill', 'jbill@umbc.edu', '45 Wise Avn', 'Baltimore', 'Maryland', 21223, 4, '445', '4443', '5565'),
 (2, 1, 'Bob Bell', 'bbell@umbc.edu', '423 Merrit', 'Baltimore', 'Maryland', 21223, 5, '332', '4242', '42424'),
 (3, 1, 'Jimmy Red', 'jred@umbc.edu', '231 Mid', 'Baltimore', 'Maryland', 21223, 1, None, None, None),
 (4, 2, 'Sam Green', 'sgreen@umbc.edu', '1234 Top', 'Baltimore', 'Maryland', 21223, 6, None, None, None),
 (5, 3, 'Quinn Blue', 'qblue@umbc.edu', '543 GreenWay', 'Baltimore', 'Maryland', 21223, 9, None, None, None),
 (6, 4, 'Tom Pink', 'tpink@umbc.edu', '1345 RedWay', 'Baltimore', 'Maryland', 21223, None, None, None, None)]

In [6]:
%%sql 

SELECT * 
FROM Associates;

 * mysql+mysqlconnector://bryan:***@localhost:3306/projectdb
   sqlite:///test.sqlite
3 rows affected.

[(1, 'John Bill', 10), (2, 'Bob Bell', 4), (3, 'Jimmy Red', 4)]

In [7]:
%%sql

SELECT *
FROM Partners;

 * mysql+mysqlconnector://bryan:***@localhost:3306/projectdb
   sqlite:///test.sqlite
3 rows affected.

[(4, 'Sam Green', 0), (5, 'Quinn Blue', 0), (6, 'Tom Pink', 0)]

In [8]:
%%sql

SELECT *
FROM Client;

 * mysql+mysqlconnector://bryan:***@localhost:3306/projectdb
   sqlite:///test.sqlite
12 rows affected.

[(1, 'Stan Brown', 'sbrown@umbc.edu', 10000, 'Commerical', '563 A Street', 'Baltimore', 'Maryland', 21223, None, None, 3232, 232323),
 (2, 'James Pro', 'jpro@umbc.edu', 100000, 'Commerical', '56 B Street', 'Baltimore', 'Maryland', 21223, None, None, 322432, 23623),
 (3, 'Lance Bo', 'lbo@umbc.edu', 12000, 'Commerical', '63 C Street', 'Baltimore', 'Maryland', 21223, None, None, 3232, 232323),
 (4, 'Nanes Po', 'npo@umbc.edu', 40000, 'Commerical', '578 D Street', 'Baltimore', 'Maryland', 21223, None, None, 320032, 234212323),
 (5, 'Krames Taq', 'ktaq@umbc.edu', 990, 'Residential', '123 E Street', 'Baltimore', 'Maryland', 21223, None, None, 329932, 25632323),
 (6, 'Ame Un', 'aun@umbc.edu', 1000, 'Residential', '104 F Street', 'Baltimore', 'Maryland', 211223, None, None, 323652, 232323),
 (7, 'Suzanne Joseph', 'sjoseph@umbc.edu', 109700, 'Residential', '101 G Street', 'Baltimore', 'Maryland', 211223, None, None, 362, 555),
 (8, 'Valentino Castro', 'vcastro@umbc.edu', 523000, 'Residential', '190 H Street', 'Baltimore', 'Maryland', 211223, None, None, 309, 194),
 (9, 'Bethany Devlin', 'bdevlin@umbc.edu', 344500, 'Industrial', '063 I Street', 'Baltimore', 'Maryland', 211223, None, None, 321394, 234523),
 (10, 'Cem Vega', 'cvega@umbc.edu', 1043200, 'Industrial', '103 J Street', 'Baltimore', 'Maryland', 211223, None, None, 3362, 2378),
 (11, 'Aiysha Gamble', 'agamble@umbc.edu', 140500, 'Industrial', '987 K Street', 'Baltimore', 'Maryland', 211223, None, None, 334552, 687323),
 (12, 'Kasim Milne', 'kmilne@umbc.edu', 96000, 'Industrial', '987 I Street', 'Baltimore', 'Maryland', 211223, None, None, 32952, 232303)]

In [10]:
%%sql

SELECT * 
FROM Property_Owner;

   mysql+mysqlconnector://bryan:***@localhost:3306/homework2
 * mysql+mysqlconnector://bryan:***@localhost:3306/projectdb
   sqlite:///test.sqlite
6 rows affected.

[(1, 4, 'Henry White', 'hwhite@umbc.edu', '525 J Road', 'Baltimore', 'Maryland', 212223, 7, None, 23455, None),
 (2, 4, 'Cindy Morse', 'cMorse@umbc.edu', '5253 K Road', 'Baltimore', 'Maryland', 212223, 44, None, 424244, None),
 (3, 5, 'Eleni Cohen', 'eCohen@umbc.edu', '35 L Road', 'Baltimore', 'Maryland', 212223, None, None, None, 41445),
 (4, 5, 'Bartosz Scott', 'bscott@umbc.edu', '525 M Road', 'Baltimore', 'Maryland', 212223, None, 13456, None, 24244),
 (5, 6, 'Jonah Ho', 'jho@umbc.edu', '525 N Road', 'Baltimore', 'Maryland', 212223, None, None, 3636, None),
 (6, 6, 'Derek Burn', 'dburn@umbc.edu', '525 O Road', 'Baltimore', 'Maryland', 212223, 4, 152, None, 5355)]

In [9]:
%%sql 

SELECT * 
FROM Rental_Properties;

 * mysql+mysqlconnector://bryan:***@localhost:3306/projectdb
   sqlite:///test.sqlite
18 rows affected.

[(1, 'Oak Hill', 13300, 10000, 1, '234 A street', 'Baltimore', 'Maryland', 212223, 4),
 (2, 'Willow Hill', 24500, 50000, 1, '2445 B street', 'Baltimore', 'Maryland', 212223, 1),
 (3, 'Honey Hill', 11450, 102450, 1, '3 C street', 'Baltimore', 'Maryland', 212223, 2),
 (4, 'Coco Hill', 13300, 20000, 1, '4 D street', 'Baltimore', 'Maryland', 212223, 3),
 (5, 'Ash Hill', 25000, 30000, 1, '6 F street', 'Baltimore', 'Maryland', 212223, 5),
 (6, 'Bay Hill', 45000, 40000, 1, '7 G street', 'Baltimore', 'Maryland', 212223, 6),
 (7, 'Rubber Hill', 35000, 50000, 1, '8 H street', 'Baltimore', 'Maryland', 212223, 7),
 (8, 'Fig Hill', 55000, 25000, 1, '9 I street', 'Baltimore', 'Maryland', 212223, 8),
 (9, 'Locust Hill', 50000, 35000, 1, '10 J street', 'Baltimore', 'Maryland', 212223, 9),
 (10, 'American Hill', 60000, 45000, 0, '11 K street', 'Baltimore', 'Maryland', 212223, 10),
 (11, 'Dragon Hill', 70000, 55000, 0, '12 L street', 'Baltimore', 'Maryland', 212223, 11),
 (12, 'Tree Hill', 80000, 65000, 0, '13 M street', 'Baltimore', 'Maryland', 212223, 12),
 (13, 'Beech Hill', 45000, 75000, 0, '14 N street', 'Baltimore', 'Maryland', 212223, 13),
 (14, 'Black Hill', 32000, 85000, 0, '15 O street', 'Baltimore', 'Maryland', 212223, 14),
 (15, 'White Hill', 43000, 95000, 0, '16 P street', 'Baltimore', 'Maryland', 212223, 15),
 (16, 'Grey Hill', 40500, 100000, 0, '17 Q street', 'Baltimore', 'Maryland', 212223, 16),
 (17, 'Blue Hill', 190000, 1000, 0, '18 P street', 'Baltimore', 'Maryland', 212223, 17),
 (18, 'Red Hill', 150000, 980000, 0, '19 Q street', 'Baltimore', 'Maryland', 212223, 18)]

In [10]:
%%sql

SELECT * 
FROM Residential;

 * mysql+mysqlconnector://bryan:***@localhost:3306/projectdb
   sqlite:///test.sqlite
6 rows affected.

[(1, 'Oak Hill', 2, 2),
 (2, 'Willow Hill', 4, 3),
 (3, 'Honey Hill', 5, 3),
 (4, 'Coco Hill', 3, 3),
 (5, 'Ash Hill', 4, 4),
 (6, 'Bay Hill', 5, 5)]

In [11]:
%%sql

SELECT * 
FROM Commerical;

 * mysql+mysqlconnector://bryan:***@localhost:3306/projectdb
   sqlite:///test.sqlite
6 rows affected.

[(7, 'Rubber Hill', 'Burger King'),
 (8, 'Fig Hill', 'Burger King'),
 (9, 'Locust Hill', 'Five Guys'),
 (10, 'American Hill', 'Five Guys'),
 (11, 'Dragon Hill', 'KFC'),
 (12, 'Tree Hill', 'KFC')]

In [12]:
%%sql 

SELECT *
FROM Industrial;

 * mysql+mysqlconnector://bryan:***@localhost:3306/projectdb
   sqlite:///test.sqlite
6 rows affected.

[(13, 'Beech Hill', 'Amazon'),
 (14, 'Black Hill', 'Amazon'),
 (15, 'White Hill', 'Apple'),
 (16, 'Grey Hill', 'Apple'),
 (17, 'Blue Hill', 'Microsoft'),
 (18, 'Red Hill', 'Microsoft')]

In [13]:
%%sql

SELECT * 
FROM Property_Viewing;

 * mysql+mysqlconnector://bryan:***@localhost:3306/projectdb
   sqlite:///test.sqlite
12 rows affected.

[(1, 'Oak Hill', datetime.date(2020, 6, 15), datetime.timedelta(seconds=21600)),
 (1, 'Oak Hill', datetime.date(2020, 6, 15), datetime.timedelta(seconds=25200)),
 (1, 'Oak Hill', datetime.date(2020, 6, 15), datetime.timedelta(seconds=28800)),
 (1, 'Oak Hill', datetime.date(2020, 6, 15), datetime.timedelta(seconds=32400)),
 (2, 'Willow Hill', datetime.date(2020, 6, 16), datetime.timedelta(seconds=25200)),
 (2, 'Willow Hill', datetime.date(2020, 6, 16), datetime.timedelta(seconds=28800)),
 (2, 'Willow Hill', datetime.date(2020, 6, 16), datetime.timedelta(seconds=32400)),
 (1, 'Oak Hill', datetime.date(2020, 6, 16), datetime.timedelta(seconds=36000)),
 (3, 'Honey Hill', datetime.date(2020, 6, 17), datetime.timedelta(seconds=21600)),
 (3, 'Honey Hill', datetime.date(2020, 6, 17), datetime.timedelta(seconds=25200)),
 (3, 'Honey Hill', datetime.date(2020, 6, 18), datetime.timedelta(seconds=28800)),
 (3, 'Honey Hill', datetime.date(2020, 6, 18), datetime.timedelta(seconds=32400))]

In [14]:
%%sql 

SELECT * 
FROM Lease;

 * mysql+mysqlconnector://bryan:***@localhost:3306/projectdb
   sqlite:///test.sqlite
6 rows affected.

[(1, datetime.date(2020, 6, 15), 4000, 1200, datetime.date(2020, 6, 16), datetime.date(2020, 10, 16)),
 (2, datetime.date(2020, 5, 15), 5000, 1200, datetime.date(2020, 5, 16), datetime.date(2020, 9, 16)),
 (3, datetime.date(2020, 4, 15), 6000, 1200, datetime.date(2020, 4, 16), datetime.date(2020, 8, 16)),
 (4, datetime.date(2020, 3, 15), 8000, 1200, datetime.date(2020, 3, 16), datetime.date(2020, 7, 16)),
 (5, datetime.date(2020, 7, 15), 7000, 6200, datetime.date(2020, 7, 16), datetime.date(2020, 11, 16)),
 (6, datetime.date(2020, 8, 15), 9000, 7200, datetime.date(2020, 8, 16), datetime.date(2020, 12, 16))]

# Queries for Relationships

In [15]:
%%sql

SELECT * 
FROM Arranges;

 * mysql+mysqlconnector://bryan:***@localhost:3306/projectdb
   sqlite:///test.sqlite
12 rows affected.

[(1, 'John Bill', 1, 'Oak Hill', datetime.date(2020, 6, 15), datetime.timedelta(seconds=21600)),
 (1, 'John Bill', 1, 'Oak Hill', datetime.date(2020, 6, 15), datetime.timedelta(seconds=25200)),
 (1, 'John Bill', 1, 'Oak Hill', datetime.date(2020, 6, 15), datetime.timedelta(seconds=28800)),
 (1, 'John Bill', 1, 'Oak Hill', datetime.date(2020, 6, 15), datetime.timedelta(seconds=32400)),
 (2, 'Bob Bell', 2, 'Willow Hill', datetime.date(2020, 6, 15), datetime.timedelta(seconds=21600)),
 (2, 'Bob Bell', 2, 'Willow Hill', datetime.date(2020, 6, 15), datetime.timedelta(seconds=25200)),
 (2, 'Bob Bell', 2, 'Willow Hill', datetime.date(2020, 6, 15), datetime.timedelta(seconds=28800)),
 (2, 'Bob Bell', 2, 'Willow Hill', datetime.date(2020, 6, 15), datetime.timedelta(seconds=32400)),
 (3, 'Jimmy Red', 3, 'Willow Hill', datetime.date(2020, 6, 15), datetime.timedelta(seconds=21600)),
 (3, 'Jimmy Red', 3, 'Willow Hill', datetime.date(2020, 6, 15), datetime.timedelta(seconds=25200)),
 (3, 'Jimmy Red', 3, 'Willow Hill', datetime.date(2020, 6, 15), datetime.timedelta(seconds=28800)),
 (3, 'Jimmy Red', 3, 'Willow Hill', datetime.date(2020, 6, 15), datetime.timedelta(seconds=32400))]

In [16]:
%%sql

SELECT * 
FROM Assigned_Partner;

 * mysql+mysqlconnector://bryan:***@localhost:3306/projectdb
   sqlite:///test.sqlite
6 rows affected.

[(4, 'Sam Green', 1, 'Henry White'),
 (4, 'Sam Green', 2, 'Cindy Morse'),
 (5, 'Quinn Blue', 3, 'Eleni Cohen'),
 (5, 'Quinn Blue', 4, 'Bartosz Scott'),
 (6, 'Tom Pink', 5, 'Johan Ho'),
 (6, 'Tom Pink', 6, 'Derek Burn')]

In [17]:
%%sql

SELECT * 
FROM Assigned_Property;

 * mysql+mysqlconnector://bryan:***@localhost:3306/projectdb
   sqlite:///test.sqlite
18 rows affected.

[(1, 'John Bill', 1, 'Oak Hill', 1),
 (1, 'John Bill', 2, 'Willow Hill', 1),
 (1, 'John Bill', 3, 'Honey Hill', 1),
 (1, 'John Bill', 4, 'Coco Hill', 1),
 (2, 'Bob Bell', 5, 'Ash Hill', 1),
 (2, 'Bob Bell', 6, 'Bay Hill', 1),
 (2, 'Bob Bell', 7, 'Rubber Hill', 1),
 (2, 'Bob Bell', 8, 'Fig Hill', 1),
 (3, 'Jimmy Red', 9, 'Locust Hill', 1),
 (3, 'Jimmy Red', 10, 'American Hill', 1),
 (3, 'Jimmy Red', 11, 'Dragon Hill', 1),
 (3, 'Jimmy Red', 12, 'Tree Hill', 1),
 (1, 'John Bill', 13, 'Beech Hill Hill', 1),
 (1, 'John Bill', 14, 'Black Hill', 1),
 (1, 'John Bill', 15, 'White Hill', 1),
 (1, 'John Bill', 16, 'Grey Hill', 1),
 (1, 'John Bill', 17, 'Blue Hill', 1),
 (1, 'John Bill', 18, 'Red Hill', 1)]

In [18]:
%%sql

SELECT * 
FROM Contract;

 * mysql+mysqlconnector://bryan:***@localhost:3306/projectdb
   sqlite:///test.sqlite
6 rows affected.

[(1, 'Ash Hill', 5),
 (2, 'Bay Hill', 6),
 (3, 'Rubber Hill', 7),
 (4, 'Fig Hill', 8),
 (5, 'Locust Hill', 9),
 (6, 'American Hill', 10)]

In [19]:
%%sql 

SELECT * 
FROM Owned_By;

 * mysql+mysqlconnector://bryan:***@localhost:3306/projectdb
   sqlite:///test.sqlite
18 rows affected.

[(1, 'Oak Hill', 1, 'Henry White'),
 (2, 'Willow Hill', 1, 'Henry White'),
 (3, 'Honey Hill', 1, 'Henry White'),
 (4, 'Coco Hill', 2, 'Cindy Morse'),
 (5, 'Ash', 2, 'Cindy Morse'),
 (6, 'Bay Hill', 2, 'Cindy Morse'),
 (7, 'Rubber Hill', 3, 'Eleni Cohen'),
 (8, 'Fig Hill', 3, 'Eleni Cohen'),
 (9, 'Locust Hill', 3, 'Eleni Cohen'),
 (10, 'American Hill', 4, 'Bartosz Scott'),
 (11, 'Dragon Hill', 4, 'Bartosz Scott'),
 (12, 'Tree Hill', 4, 'Bartosz Scott'),
 (13, 'Beech Hill', 5, 'Johan Ho'),
 (14, 'Black Hill', 5, 'Johan Ho'),
 (15, 'White Hill', 5, 'Johan Ho'),
 (16, 'Grey Hill', 6, 'Derek Burn'),
 (17, 'Blue Hill', 6, 'Derek Burn'),
 (18, 'Red Hill', 6, 'Derek Burn')]

In [20]:
%%sql

SELECT * 
FROM Tours;

 * mysql+mysqlconnector://bryan:***@localhost:3306/projectdb
   sqlite:///test.sqlite
12 rows affected.

[(1, 'Henry White', 1, 'Oak Hill', datetime.date(2020, 6, 15), datetime.timedelta(seconds=21600)),
 (1, 'Henry White', 1, 'Oak Hill', datetime.date(2020, 6, 15), datetime.timedelta(seconds=25200)),
 (1, 'Henry White', 1, 'Oak Hill', datetime.date(2020, 6, 15), datetime.timedelta(seconds=28800)),
 (1, 'Henry White', 1, 'Oak Hill', datetime.date(2020, 6, 15), datetime.timedelta(seconds=32400)),
 (1, 'Henry White', 2, 'Willow Hill', datetime.date(2020, 6, 16), datetime.timedelta(seconds=21600)),
 (1, 'Henry White', 2, 'Willow Hill', datetime.date(2020, 6, 16), datetime.timedelta(seconds=25200)),
 (1, 'Henry White', 2, 'Willow Hill', datetime.date(2020, 6, 16), datetime.timedelta(seconds=28800)),
 (1, 'Henry White', 2, 'Willow Hill', datetime.date(2020, 6, 16), datetime.timedelta(seconds=32400)),
 (1, 'Henry White', 3, 'Honey Hill', datetime.date(2020, 6, 17), datetime.timedelta(seconds=21600)),
 (1, 'Henry White', 3, 'Honey Hill', datetime.date(2020, 6, 17), datetime.timedelta(seconds=25200)),
 (1, 'Henry White', 3, 'Honey Hill', datetime.date(2020, 6, 17), datetime.timedelta(seconds=28800)),
 (1, 'Henry White', 3, 'Honey Hill', datetime.date(2020, 6, 17), datetime.timedelta(seconds=32400))]

In [21]:
%%sql

SELECT * 
FROM Views;

 * mysql+mysqlconnector://bryan:***@localhost:3306/projectdb
   sqlite:///test.sqlite
12 rows affected.

[(1, 'Stan Brown', 1, 'Oak Hill', datetime.date(2020, 6, 15), datetime.timedelta(seconds=21600)),
 (2, 'James Pro', 1, 'Oak Hill', datetime.date(2020, 6, 15), datetime.timedelta(seconds=25200)),
 (3, 'Lance Bo', 1, 'Oak Hill', datetime.date(2020, 6, 15), datetime.timedelta(seconds=28800)),
 (4, 'Nanes Po', 1, 'Oak Hill', datetime.date(2020, 6, 15), datetime.timedelta(seconds=32400)),
 (5, 'Krames Taq', 2, 'Willow Hill', datetime.date(2020, 6, 16), datetime.timedelta(seconds=21600)),
 (6, 'Ame Un', 2, 'Willow Hill', datetime.date(2020, 6, 16), datetime.timedelta(seconds=25200)),
 (7, 'Suzanne Joseph', 2, 'Willow Hill', datetime.date(2020, 6, 16), datetime.timedelta(seconds=28800)),
 (8, 'Valention Castro', 2, 'Willow Hill', datetime.date(2020, 6, 16), datetime.timedelta(seconds=32400)),
 (9, 'Bethany Devlin', 3, 'Honey Hill', datetime.date(2020, 6, 17), datetime.timedelta(seconds=21600)),
 (10, 'Cem Vega', 3, 'Honey Hill', datetime.date(2020, 6, 17), datetime.timedelta(seconds=25200)),
 (11, 'Aiysha Gamble', 3, 'Honey Hill', datetime.date(2020, 6, 17), datetime.timedelta(seconds=28800)),
 (12, 'Kasim Milne', 3, 'Honey Hill', datetime.date(2020, 6, 17), datetime.timedelta(seconds=32400))]

In [22]:
%%sql

SELECT * 
FROM Sign_Lease;

 * mysql+mysqlconnector://bryan:***@localhost:3306/projectdb
   sqlite:///test.sqlite
6 rows affected.

[(1, 'Stan Brown', 1),
 (1, 'Stan Brown', 2),
 (1, 'Stan Brown', 3),
 (1, 'Stan Brown', 4),
 (1, 'Stan Brown', 5),
 (1, 'Stan Brown', 6)]

In [23]:
%%sql

SELECT * 
FROM Writes_Lease;

 * mysql+mysqlconnector://bryan:***@localhost:3306/projectdb
   sqlite:///test.sqlite
6 rows affected.

[(1, 'Stan Brown', 1),
 (1, 'Stan Brown', 2),
 (2, 'Bob Bell', 3),
 (2, 'Bob Bell', 4),
 (3, 'Jimmy Red', 5),
 (3, 'Bob Bell', 6)]

# Project Querries and Reports

## 1) List the names of all the unique clients

In [24]:
%%sql 
SELECT DISTINCT Client_Name
FROM Client;

 * mysql+mysqlconnector://bryan:***@localhost:3306/projectdb
   sqlite:///test.sqlite
12 rows affected.

[('Aiysha Gamble',),
 ('Ame Un',),
 ('Bethany Devlin',),
 ('Cem Vega',),
 ('James Pro',),
 ('Kasim Milne',),
 ('Krames Taq',),
 ('Lance Bo',),
 ('Nanes Po',),
 ('Stan Brown',),
 ('Suzanne Joseph',),
 ('Valentino Castro',)]

## 2) Find the unique names of owners and total square footage of all the properties they own

In [25]:
%%sql
SELECT DISTINCT Owner_Name, SUM(Area_Square_Footing) as 'Total Square Footage'
FROM Owned_By NATURAL JOIN Rental_Properties 
GROUP BY Owner_Name;

 * mysql+mysqlconnector://bryan:***@localhost:3306/projectdb
   sqlite:///test.sqlite
6 rows affected.

[('Henry White', Decimal('49250')),
 ('Cindy Morse', Decimal('58300')),
 ('Eleni Cohen', Decimal('140000')),
 ('Bartosz Scott', Decimal('210000')),
 ('Johan Ho', Decimal('120000')),
 ('Derek Burn', Decimal('380500'))]

## 3) Find the properties shown by each associate in a given month. 
It is possible to get every month by changing the third line to be any month, so any number 00 - 12

In [26]:
%%sql
SELECT Employee_Name, Property_Name
FROM Arranges
WHERE MONTH(Viewing_Date) = '06'
GROUP BY Employee_Name;

 * mysql+mysqlconnector://bryan:***@localhost:3306/projectdb
   sqlite:///test.sqlite
3 rows affected.

[('John Bill', 'Oak Hill'),
 ('Bob Bell', 'Willow Hill'),
 ('Jimmy Red', 'Willow Hill')]

## 4) Find the most popular properties (in terms of number of viewings in a given year)
This querry can be changed to be any year,
Chaning the Where claus to be any valid year

In [30]:
%%sql
SELECT Property_Name, Count(Property_Name) as 'Viewing Per Year in 2020'
FROM Property_Viewing
WHERE Year(Viewing_Date) = '2020'
GROUP BY Property_Name;

 * mysql+mysqlconnector://bryan:***@localhost:3306/projectdb
   sqlite:///test.sqlite
3 rows affected.

[('Oak Hill', 5), ('Willow Hill', 3), ('Honey Hill', 4)]

## 5) Find the total rent due to each property owner.

In [32]:
%%sql
SELECT Owner_Name as 'Property Owner', Sum(Lease_Monthly_Rent) as 'Total Rent'
FROM(Lease NATURAL JOIN Contract), Rental_Properties, Owned_By
WHERE (Contract.Property_Num = Rental_Properties.Property_Num) AND Rental_Properties.Property_Num = Owned_By.Property_Num
Group BY Owner_Name;

 * mysql+mysqlconnector://bryan:***@localhost:3306/projectdb
   sqlite:///test.sqlite
3 rows affected.

[('Cindy Morse', Decimal('2400')),
 ('Eleni Cohen', Decimal('8600')),
 ('Bartosz Scott', Decimal('7200'))]

## 6) Find the unique names of associates supervised (directly or indirectly) by a given employee
This querry can be adjusted by changing the Supervisor_Num

In [58]:
%%sql 
SELECT DISTINCT Employee_Name
FROM Associates NATURAL JOIN Employee 
WHERE (Supervisor_Num = 1) and (Employee_Num != Supervisor_Num);

 * mysql+mysqlconnector://bryan:***@localhost:3306/projectdb
   sqlite:///test.sqlite
2 rows affected.

[('Bob Bell',), ('Jimmy Red',)]

## 7)  Find the unique names of owners that have a residential property in every city where Pat Doe owns a commercial property

In [5]:
%%sql
SELECT DISTINCT Owner_Name
FROM Owned_By NATURAL JOIN Rental_Properties
WHERE(Property_City in (SELECT Property_City
FROM Owned_By NATURAL JOIN Rental_Properties
WHERE(Owner_Name = 'Pat Doe' and Property_Type = 'Commerical')))
GROUP BY Owner_Name;

 * mysql+mysqlconnector://bryan:***@localhost:3306/projectdb
   sqlite:///test.sqlite
6 rows affected.

[('Henry White',),
 ('Cindy Morse',),
 ('Eleni Cohen',),
 ('Pat Doe',),
 ('Johan Ho',),
 ('Derek Burn',)]

## 8) Find the top-3 partners with respect to number of properties leased in the current year
This querry can be changed for any valid year. 
Just change the WHERE claus to equal any year

In [56]:
%%sql 
SELECT Employee_Name, Count(*) as ' Number of Properties'
FROM Writes_Lease NATURAL JOIN Lease
WHERE YEAR(Lease_Date) = '2020'
GROUP BY Employee_Name
Order BY Count(*) DESC
LIMIT 3;

 * mysql+mysqlconnector://bryan:***@localhost:3306/projectdb
   sqlite:///test.sqlite
3 rows affected.

[('Bob Bell', 3), ('Stan Brown', 2), ('Jimmy Red', 1)]

## 9) Write a SQL function to compute the total management fees due to Pluto in the last 3 months.
This example shows the current date to be June. So the months managment fees is going to be calulated is going to be June, May and April or 06, 05 and 04. To be able to change this function to any date you want, you must be root access. So if you want to start in November, Change the following 06 to 11, them change 05 to 10 and finally change 04 to 09.

%%sql

DROP FUNCTION IF EXISTS MonthlyManagmentFees;

DELIMITER $$

CREATE FUNCTION MonthlyManagmentFees(Property_Num int) 
    
    RETURNS INTEGER
    CONTAINS SQL READS SQL DATA

BEGIN 
	
    DECLARE amount_one INTEGER;
	DECLARE amount_two INTEGER;
    DECLARE amount_three INTEGER;
    
    SELECT SUM(Monthly_Manage_Fee) INTO amount_one
	FROM(Lease NATURAL JOIN Contract), Rental_Properties
	WHERE (Contract.Property_Num = Rental_Properties.Property_Num) 
    AND (Month(Lease_Date) = '04' AND Month(Lease_End_Date) > '06' );
	
	SELECT SUM(Monthly_Manage_Fee) INTO amount_two
	FROM(Lease NATURAL JOIN Contract), Rental_Properties
	WHERE (Contract.Property_Num = Rental_Properties.Property_Num) 
    AND (Month(Lease_Date) = '05' OR Month(Lease_Date) = '04') AND (Month(Lease_End_Date) > '06');
    
	SELECT SUM(Monthly_Manage_Fee) INTO amount_three
	FROM(Lease NATURAL JOIN Contract), Rental_Properties
	WHERE (Contract.Property_Num = Rental_Properties.Property_Num) 
    AND (Month(Lease_Date) = '06' OR Month(Lease_Date) = '05' OR Month(Lease_Date) = '04') AND (Month(Lease_End_Date) > '06' );
    
    Return amount_one + amount_two + amount_three;
END$$

DELIMITER ;

In [4]:
%%sql 
SELECT DISTINCT MonthlyManagmentFees(Property_Num) as 'Total 3 Month Fees'
FROM Rental_Properties

 * mysql+mysqlconnector://bryan:***@localhost:3306/projectdb
   sqlite:///test.sqlite
1 rows affected.

[(260000,)]

## 10) Create a SQL trigger to automatically set to FALSE the advertisement flag of a property when it is leased.

### There is two trigges that I have wrote, one to automatically set the Rental Property to be advertised when inserted, and the second one that corresponds to number 10.

DROP TRIGGER IF EXISTS IntialAdvertisment; 
DELIMITER $$ 

CREATE TRIGGER IntialAdvertisment 
	before INSERT ON Rental_Properties FOR EACH ROW

Begin
    Set new.Advertised = 1;

END$$
DELIMITER ;  


DROP TRIGGER IF EXISTS UpdateAdvertisment; 
DELIMITER $$ 
CREATE TRIGGER UpdateAdvertisment
AFTER INSERT ON Contract FOR EACH ROW 
 Begin
     UPDATE Rental_Properties
     Set Advertised = 0 
     Where Property_Num = new.Property_Num;
END$$
DELIMITER ;

In [84]:
target = %sql SELECT * FROM Contract;

result_before = %sql SELECT * FROM Rental_Properties;

print('Results Before Update\n')
display(result_before.DataFrame())

 * mysql+mysqlconnector://bryan:***@localhost:3306/projectdb
   sqlite:///test.sqlite
0 rows affected.
 * mysql+mysqlconnector://bryan:***@localhost:3306/projectdb
   sqlite:///test.sqlite
18 rows affected.
Results Before Update

,Property_Num,Property_Name,Area_Square_Footing,Monthly_Manage_Fee,Advertised,Property_Type,Property_Street,Property_City,Property_State,Property_Zip_Code,Property_Unit_Num
0,1,Oak Hill,13300,10000,1,Residential,234 A street,Baltimore,Maryland,212223,4
1,2,Willow Hill,24500,50000,1,Residential,2445 B street,Baltimore,Maryland,212223,1
2,3,Honey Hill,11450,102450,1,Residential,3 C street,Baltimore,Maryland,212223,2
3,4,Coco Hill,13300,20000,1,Residential,4 D street,Baltimore,Maryland,212223,3
4,5,Ash Hill,25000,30000,1,Residential,6 F street,Baltimore,Maryland,212223,5
5,6,Bay Hill,45000,40000,1,Residential,7 G street,Baltimore,Maryland,212223,6
6,7,Rubber Hill,35000,50000,1,Commerical,8 H street,Baltimore,Maryland,212223,7
7,8,Fig Hill,55000,25000,1,Commerical,9 I street,Baltimore,Maryland,212223,8
8,9,Locust Hill,50000,35000,1,Commerical,10 J street,Baltimore,Maryland,212223,9
9,10,American Hill,60000,45000,1,Commerical,11 K street,Baltimore,Maryland,212223,10
10,11,Dragon Hill,70000,55000,1,Commerical,12 L street,Baltimore,Maryland,212223,11
11,12,Tree Hill,80000,65000,1,Commerical,13 M street,Baltimore,Maryland,212223,12
12,13,Beech Hill,45000,75000,1,Industrial,14 N street,Baltimore,Maryland,212223,13
13,14,Black Hill,32000,85000,1,Industrial,15 O street,Baltimore,Maryland,212223,14
14,15,White Hill,43000,95000,1,Industrial,16 P street,Baltimore,Maryland,212223,15
15,16,Grey Hill,40500,100000,1,Industrial,17 Q street,Baltimore,Maryland,212223,16
16,17,Blue Hill,190000,1000,1,Industrial,18 P street,Baltimore,Maryland,212223,17
17,18,Red Hill,150000,980000,1,Industrial,19 Q street,Baltimore,Maryland,212223,18

In [86]:
target = %sql SELECT * FROM Contract;

result_after = %sql SELECT * FROM Rental_Properties;

print('Results After Update\n')
display(result_after.DataFrame())

 * mysql+mysqlconnector://bryan:***@localhost:3306/projectdb
   sqlite:///test.sqlite
6 rows affected.
 * mysql+mysqlconnector://bryan:***@localhost:3306/projectdb
   sqlite:///test.sqlite
18 rows affected.
Results After Update

,Property_Num,Property_Name,Area_Square_Footing,Monthly_Manage_Fee,Advertised,Property_Type,Property_Street,Property_City,Property_State,Property_Zip_Code,Property_Unit_Num
0,1,Oak Hill,13300,10000,1,Residential,234 A street,Baltimore,Maryland,212223,4
1,2,Willow Hill,24500,50000,1,Residential,2445 B street,Baltimore,Maryland,212223,1
2,3,Honey Hill,11450,102450,1,Residential,3 C street,Baltimore,Maryland,212223,2
3,4,Coco Hill,13300,20000,1,Residential,4 D street,Baltimore,Maryland,212223,3
4,5,Ash Hill,25000,30000,0,Residential,6 F street,Baltimore,Maryland,212223,5
5,6,Bay Hill,45000,40000,0,Residential,7 G street,Baltimore,Maryland,212223,6
6,7,Rubber Hill,35000,50000,0,Commerical,8 H street,Baltimore,Maryland,212223,7
7,8,Fig Hill,55000,25000,0,Commerical,9 I street,Baltimore,Maryland,212223,8
8,9,Locust Hill,50000,35000,0,Commerical,10 J street,Baltimore,Maryland,212223,9
9,10,American Hill,60000,45000,0,Commerical,11 K street,Baltimore,Maryland,212223,10
10,11,Dragon Hill,70000,55000,1,Commerical,12 L street,Baltimore,Maryland,212223,11
11,12,Tree Hill,80000,65000,1,Commerical,13 M street,Baltimore,Maryland,212223,12
12,13,Beech Hill,45000,75000,1,Industrial,14 N street,Baltimore,Maryland,212223,13
13,14,Black Hill,32000,85000,1,Industrial,15 O street,Baltimore,Maryland,212223,14
14,15,White Hill,43000,95000,1,Industrial,16 P street,Baltimore,Maryland,212223,15
15,16,Grey Hill,40500,100000,1,Industrial,17 Q street,Baltimore,Maryland,212223,16
16,17,Blue Hill,190000,1000,1,Industrial,18 P street,Baltimore,Maryland,212223,17
17,18,Red Hill,150000,980000,1,Industrial,19 Q street,Baltimore,Maryland,212223,18